
window.onload = () => {
    function isIOS() {
        return /iPad|iPhone|iPod/.test(navigator.userAgent) && !window.MSStream;
    }

    let events = [];

    if (isIOS()) {
        if (totalValue < 2) {
            events = [
                {
                    title: 'خامل',
                    description: "شهر جديد وإنجازات جديدة كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله",
                    start: '20231101T090000Z',
                    end: '20231101T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'هدفك في هذا الأسبوع١٤ دقيقة مشي يومين بالأسبوع لا  تنسَ سخن عضلاتك وهيئ جسمك قبل تمشي',
                    start: '20231105T090000Z',
                    end: '20231105T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'الالتزام بسلوك المشي سهل... لو غيرت البيئة زودت الحركة بتفاصيل يومك مشيت مع  صديق أو عائلتك ',
                    start: '20231107T090000Z',
                    end: '20231107T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "تعرف علامات المشي الصحيح؟ اطلع على الرابط التالي https://www.moh.gov.sa/HealthAwareness/EducationalContent/PublicHealth/Pages/Walking.aspx ",
                    start: '20231110T090000Z',
                    end: '20231110T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "زود يوم  على هدفك  وامش ١٤ دقيقة ٣ ايام بالأسبوع ",
                    start: '20231112T090000Z',
                    end: '20231112T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "قبل تمشي اليوم  تأكد من اختيار الحذاء الصحيح المناسب لك يكون مقاسك سميك من جهة الكعب.  مزود بطبقة لتوسيد القدم. كعب ثابت لتثبيت القدم",
                    start: '20231114T090000Z',
                    end: '20231114T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼 ‏وجمعتك مباركة",
                    start: '20231117T090000Z',
                    end: '20231117T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'جاء الوقت ارفع هدفك وزود  دقيقتين وخلها ١٦',
                    start: '20231119T090000Z',
                    end: '202311019T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "المشي يأخذ  ٢٪ تقريبًا من يومك، وكل اللي تحتاجه  حذاء مناسب لبس مريح وانطلق📢🏃🏻",
                    start: '20231211T090000Z',
                    end: '20231121T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق  وخلها 19",
                    start: '20231126T090000Z',
                    end: '20231126T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "تحدى نفسك وأصدقائك،  مين عنده اللياقة أعلى ؟ تقدرون تستخدمون تطبيق صحتي لحساب عدد الخطوات ",
                    start: '20231124T090000Z',
                    end: '20231124T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "لا تنسَ تشرب ماء ، قبل تمشي اليوم",
                    start: '20231129T090000Z',
                    end: '20231129T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "هدفك في هذا الأسبوع٢٢ دقيقة مشي  ٣ أيام بالأسبوع لا تنسَ تمارين التمدد ",
                    start: '20231201T090000Z',
                    end: '20231201T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "كلما زاد نبضك خلال المشي كلما ارتفعت لياقتك ",
                    start: '20231204T090000Z',
                    end: '20231204T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'قيس تطور أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك ',
                    start: '20231207T090000Z',
                    end: '20231207T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ":زود دقيقتين على هدفك وامش ٢٤ دقيقة ",
                    start: '20231210T090000Z',
                    end: '20231210T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "صباحك نشاط وصحة   اختر الحذاء المناسب👟 ‏وحدد وجهتك🎯 ‏وانطلق 📢🏃🏻",
                    start: '20231212T090000Z',
                    end: '20231212T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "صباحك صحة وإنجاز 🤩❤️ كم خطوة مشيت اليوم؟ شاركنا  على #امش30",
                    start: '20231216T090000Z',
                    end: '20231216T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "جاء الوقت ارفع هدفك وزود ٣ دقائق وخلها 27  ",
                    start: '20231217T090000Z',
                    end: '20231217T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك',
                    start: '20231219T090000Z',
                    end: '20231219T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "22:خلنا معك وأنت تمشي 🏃🏻، واسمع  بودكاست #عش_بصحة https://bit.ly/3uGoNwI                            ",
                    start: '20231222T090000Z',
                    end: '20231222T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "لا تنسَ تشرب ماء ، قبل تمشي اليوم",
                    start: '20231129T090000Z',
                    end: '20231129T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق  وخلها 30",
                    start: '20231224T090000Z',
                    end: '20231224T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة",
                    start: '20231228T090000Z',
                    end: '20231228T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "مبروووك ... وصلت لـ٣٠ دقيقة 🎉 👏🏻 كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻",
                    start: '20231230T090000Z',
                    end: '20231230T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: 'هدفك في هذا الأسبوع​٣٠ دقيقة مشي ​لا تنسَ ​تمارين الاستطالة والإحماء​',
                    start: '20240101T090000Z',
                    end: '20240101T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "كيف تستمر وتحافظ على سلوك المشي؟​• غير بيئتك المحيطة، أو كن مؤثرا فيهم .​ • زود الحركة بتفاصيل يومك​ • غير مكان مشيك من فترة لفترة​• امشِ مع أحد تحبه.​",
                    start: '20240104T090000Z',
                    end: '20240104T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'زود دقيقتين على هدفك ​وامش ٣٢ دقائق​',
                    start: '20240107T090000Z',
                    end: '20240107T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ":تحس عضلاتك شاده؟ لا تنسَ ​• سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين",
                    start: '20240109T090000Z',
                    end: '20240109T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ":صباحك صحّة ✋، ​‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة",
                    start: '20240112T090000Z',
                    end: '20240112T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "جاء الوقت ارفع هدفك وزود​٣ دقائق وخلها 35 دقيقة",
                    start: '20240114T090000Z',
                    end: '20240114T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ':لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240116T090000Z',
                    end: '20240116T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "بشر، حققت الهدف هذا الأسبوع ؟🤩​في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​",
                    start: '20240119T090000Z',
                    end: '20240119T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "كفو عليك وصلت لآخر أسبوع  بهذا الشهر استمر على ٣٥، ٣ايام بالأسبوع",
                    start: '20240121T090000Z',
                    end: '20240121T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "جرب توقف اليوم بعيد، وكملها مشي للدوام.",
                    start: '20240123T090000Z',
                    end: '20240123T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!",
                    start: '20240126T090000Z',
                    end: '20240126T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "وصلنا اسبوع ٢١ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!​هدفك في هذا الأسبوع​ ٣٨ دقيقة مشي ​",
                    start: '20240128T090000Z',
                    end: '20240128T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "3 عناصر تؤثر على أدائك في التمرين:​ -نومك​ -تغذيتك خلال اليوم​ -شربك للماء​",
                    start: '20240201T090000Z',
                    end: '20240201T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "زود دقيقتين على هدفك ​وامش ٤٠ دقائق ​",
                    start: '20240204T090000Z',
                    end: '20240204T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "قوة عضلاتك، تعديل مزاجك، توازن جسمك، ولياقة قلبك، كلها تعتمد على نشاطك البدني​",
                    start: '20240206T090000Z',
                    end: '20240206T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ":اجمع الاثنين!​ اقضِ وقتك مع احبابك ، ومارسوا الرياضة معا.​",
                    start: '20240209T090000Z',
                    end: '20240209T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "استمر على هدفك ​ وامش ٤٠ دقيقةو ٣ أيام بالأسبوع ​",
                    start: '20240211T090000Z',
                    end: '20240211T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    'desription': "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                    start: '20240213T090000Z',
                    end: '20240213T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "صباحك صحة وإنجاز 🤩❤️​حافظ على صحتك واستمر بتحقيق خطواتك! 🤩​",
                    start: '20240216T090000Z',
                    end: '20240216T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٤٢  ",
                    start: '20240218T090000Z',
                    end: '20240218T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​",
                    start: '20240220T090000Z',
                    end: '20240220T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "جمعة مباركة🤍​كم خطوة مشيت اليوم؟ شاركنا  على #امش30​",
                    start: '20240223T090000Z',
                    end: '20240223T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "كفو عليك وصلت لآخر أسبوع​ بهذا الشهر زودها  ٣ دقائق ​وخلها ٤٥​",
                    start: '20240225T090000Z',
                    end: '20240225T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي  ​",
                    start: '20240227T090000Z',
                    end: '20240227T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "هدفك في هذا الأسبوع​ الاستمرار على ٤٥ دقيقة مشي ​مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​",
                    start: '20240303T090000Z',
                    end: '20240303T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: "صباحك صحة وإنجاز 🤩❤️​المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​",
                    start: '20240306T090000Z',
                    end: '20240306T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "لا تحتار متى تمشي في​ رمضان ..​بعد التراويح وقت مناسب ​أو قبل السحور",
                    start: '20240309T090000Z',
                    end: '20240309T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "جاء الوقت ارفع هدفك ​دقيقتين وخلها ٤٨    ",
                    start: '20240310T090000Z',
                    end: '20240310T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: ":رمضان كريم🤍​خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​",
                    start: '20240312T090000Z',
                    end: '20240312T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "تذكر المشي إلى المسجد صحة وأجر​",
                    start: '20240314T090000Z',
                    end: '20240314T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي  ​",
                    start: '20240303T090000Z',
                    end: '20240303T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: ":زود ٣ دقائق على هدفك يابطل وامش ٥٠ دقائق ​",
                    start: '20240317T090000Z',
                    end: '20240317T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "لا تنسَ تشرب ماء ، قبل تمشي اليوم .​",
                    start: '20240319T090000Z',
                    end: '20240319T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "كملت عدد خطواتك لليوم ؟  يمديك تلحق ​جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​",
                    start: '20240322T090000Z',
                    end: '20240322T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "كفو عليك وصلت لآخر أسبوع​ بهذا الشهر زودها  ٣ دقائق ​وخلها ٥٣​",
                    start: '20240324T090000Z',
                    end: '20240324T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "حمل كتاب صوتي أو بودكاست ​وأنطلق 🏃🏻‍♂️​",
                    start: '20240326T090000Z',
                    end: '20240326T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: "مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​​",
                    start: '20240328T090000Z',
                    end: '20240328T100000Z',
                    location: '',
                },

                {
                    title: 'خامل',
                    description: 'هدفك في هذا الأسبوع​ ٥٥ دقيقة مشي​  مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​',
                    start: '20240401T090000Z',
                    end: '20240401T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كيف تتعامل مع آلام العضلات​ بعد التمرين؟​ - أكثر من السوائل. مارس بعض تمارين الإطالة الخفيفة.​جرب الكمادات الدافئة أو الثلج لتخفيف الألم.​  جرب الجاكوزي وقم بتدليك مكان الألم.​',
                    start: '20240404T090000Z',
                    end: '20240404T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'استمر على هدفك ​ وامش ٥٥ دقيقة ٣ ايام بالأسبوع ​',
                    start: '20240407T090000Z',
                    end: '20240407T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ':لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​',
                    start: '20240409T090000Z',
                    end: '20240409T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'صباحك صحة،​كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240412T090000Z',
                    end: '20240412T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'زود ٣ دقائق على هدفك يابطل وامش ٥٨ دقائق ​',
                    start: '20240414T090000Z',
                    end: '20240414T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                    start: '20240416T090000Z',
                    end: '20240416T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: ':صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟 ​2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​ ',
                    start: '20240419T090000Z',
                    end: '20240419T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها دقيقتين بس! وخلها ٦٠ د، ​',
                    start: '20240421T090000Z',
                    end: '20240421T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كيف تكوّن صداقات جديدة مع الأشخاص النشيطين بدنيًا؟!​ انضم إلى نوادٍ رياضية، أو مجموعات مهتمة بالمشي في مدينتك عبر مواقع التواصل الاجتماعي.​',
                    start: '20240424T090000Z',
                    end: '20240424T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'مبرووووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​إنجاز يفتخر فيه فلا تنسَ تكافئ نفسك  👏🏻​وبهذه المناسبة بنغير أسلوب تحدي للشهر الجاي​',
                    start: '20240427T090000Z',
                    end: '20240427T100000Z',
                    location: '',
                },


                {
                    title: 'خامل',
                    description: 'جمعة مباركة🤍​كم خطوة مشيت اليوم؟ شاركنا  على #امش30',
                    start: '20240503T090000Z',
                    end: '20240503T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع   ',
                    start: '20240505T090000Z',
                    end: '20240505T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description:"" ,
                    start: '20240501T090000Z',
                    end: '20240501T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'احرق سعراتك واطلع امشي​',
                    start: '20240507T090000Z',
                    end: '20240507T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​ المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                    start: '20240510T090000Z',
                    end: '20240510T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع    ',
                    start: '20240512T090000Z',
                    end: '20240512T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'أحرص على ممارسة تمارين  تقوية العضلات 💪 ​على الأقل مرتين في الأسبوع​',
                    start: '20240514T090000Z',
                    end: '20240514T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​',
                    start: '20240517T090000Z',
                    end: '20240517T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'جاء الوقت زودها يوم وخلها  ٣٠~ ٦٠ دقيقة ، ٥ ايام بالأسبوع     ​',
                    start: '20240519T090000Z',
                    end: '20240519T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'إذا كنت مشغول اليوم جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240521T090000Z',
                    end: '20240521T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'صباحك نشاط وحركة ​ كل خطوة تمشيها تنعكس على صحتك، لا ينتهي يومك بدون مشي​ ',
                    start: '20240524T090000Z',
                    end: '20240524T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كفو عليك وصلت لآخر أسبوع​ بهذا الشهر استمر على ٣٠~ ٦٠ دقيقة ، ٥ ايام بالأسبوع​',
                    start: '20240526T090000Z',
                    end: '20240526T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .',
                    start: '20240529T090000Z',
                    end: '20240529T100000Z',
                    location: '',
                },


                {
                    title: 'خامل',
                    description: 'وصلنا لأخر شهر من التذكيرات ❤️​فخورين فيك حققت انجاز عظيم بـ٩ شهور بس قدرت تبدأ من الصفر حتى ٦٠ دقيقة مشي!!​بهذه المناسبة هدفك هذا الشهر بيكون مختلف،​ أنت تحدده، عندك خيارين: تزيد المدة أو الأيام ​ أو تحافظ على مستواك​مستعد!؟🤩❤️',
                    start: '20240601T090000Z',
                    end: '20240601T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'حدد خطتك وأهدافك لهذا الشهر كامل ​ وانطلق!!🏃🏻‍♂️',
                    start: '20240602T090000Z',
                    end: '20240602T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​ •  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                    start: '20240604T090000Z',
                    end: '20240604T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240609T090000Z',
                    end: '20240609T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'حددت خطتك وطبقتها؟ كل اللي عليك تراقب أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك.​',
                    start: '20240612T090000Z',
                    end: '20240612T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'كيف تستمر على اتباع سلوك المشي؟ ​ -بسط السلوك، قسم المشي على دفعات على مدار اليوم​ - اصنع  بيئة محفزة. ​-اجعل الإشارة واضحة، استخدم تطبيقات تتبّع العادات أو منبه لتذكيرك ​',
                    start: '20240617T090000Z',
                    end: '20240617T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'صباحك صحة، كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240621T090000Z',
                    end: '20240621T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'تابع تقدمك واستعد للتحديات، كن مرن ولا تخف من تعديل أو تغيير خططك وأهدافك عند مواجهة عقبات أو صعوبات ​',
                    start: '20240625T090000Z',
                    end: '20240625T100000Z',
                    location: '',
                },
                {
                    title: 'خامل',
                    description: 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الكرة بملعبك الآن، صار عندك القدرة والمهارات لممارسة المشي والمحافظة عليه',
                    start: '20240630T090000Z',
                    end: '20240630T100000Z',
                    location: '',
                },
         
            ];
        }
         else if (totalValue >= 2 && totalValue <= 4) {
            events = [
                {
                    title: 'ناوي',
                    description: ':شهر جديد وإنجازات جديدة  كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله​',
                    start: '20231101T090000Z',
                    end: '20231101T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'هدفك في هذا الأسبوع​ ٢٢ دقيقة مشي  ٣ أيام بالأسبوع​  لا تنسَ ​ تمارين التمدد ​',
                    start: '20231105T090000Z',
                    end: '20231105T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'تحدى نفسك وأصدقائك،  مين عنده اللياقة أعلى ؟​ تقدرون تستخدمون تطبيق صحتي لحساب عدد الخطوات​',
                    start: '20231110T090000Z',
                    end: '20231110T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'زود دقيقتين على هدفك يابطل​ وامش ٢٤ دقائق',
                    start: '20231112T090000Z',
                    end: '20231112T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'الالتزام بسلوك المشي سهل... لو​ • غيرت البيئة​ • زودت الحركة بتفاصيل يومك​ • مشيت مع  صديق أو عائلتك ​',
                    start: '20231114T090000Z',
                    end: '20231114T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​ وجمعتك مباركة​',
                    start: '20231117T090000Z',
                    end: '20231117T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٢٧       ',
                    start: '20231119T090000Z',
                    end: '20231119T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'الجو جميل وكل بخاطرة يمشي​ جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                    start: '20231124T090000Z',
                    end: '20231124T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'كفو عليك وصلت لآخر أسبوع​ بهذا الشهر زودها  ٣ دقائق ​ وخلها ٣٠​',
                    start: '20231126T090000Z',
                    end: '20231126T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'مبروووك ... وصلت لـ٣٠ دقيقة 🎉 👏🏻 ​كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​',
                    start: '20231128T090000Z',
                    end: '20231128T100000Z',
                    location: '',
                },
            

                {
                    title: 'ناوي',
                    description: 'هدفك في هذا الأسبوع​ ٣٠ دقيقة مشي ​ لا تنسَ ​تمارين الاستطالة والإحماء​',
                    start: '20231203T090000Z',
                    end: '20231203T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'المشي يأخذ  ٢٪ تقريبًا من يومك، وكل اللي تحتاجه ​·      حذاء مناسب​ ·      لبس مريح​ وانطلق📢🏃🏻​',
                    start: '20231205T090000Z',
                    end: '20231205T100000Z',
                    location: '',
                },
           
                
                {
                    title: 'ناوي',
                    description: 'صباحك صحّة ✋، ​‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                    start: '20231208T090000Z',
                    end: '20231208T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'زود دقيقتين على هدفك يابطل وامش ٣٢  دقيقة​',
                    start: '20231210T090000Z',
                    end: '20231210T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'جرب توقف اليوم بعيد، وكملها مشي للدوام.​',
                    start: '20231212T090000Z',
                    end: '20231212T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: ':قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20231215T090000Z',
                    end: '20231215T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٣٥         ',
                    start: '20231217T090000Z',
                    end: '20231217T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: ':كيف تستمر وتحافظ على سلوك المشي؟​ • غير بيئتك المحيطة، أو كن مؤثرا فيهم .• زود الحركة بتفاصيل يومك​ • غير مكان مشيك من فترة لفترة​ • امشِ مع أحد تحبه.​',
                    start: '20231219T090000Z',
                    end: '20231219T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: "بشر، حققت الهدف هذا الأسبوع ؟🤩​في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​",
                    start: '20231222T090000Z',
                    end: '20231222T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر  ٣٨دقيقة في ٣ايام بالأسبوع​',
                    start: '20231224T090000Z',
                    end: '20231224T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                    start: '20231226T090000Z',
                    end: '20231226T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                    start: '20231229T090000Z',
                    end: '20231229T100000Z',
                    location: '',
                },
                
                {
                    title: 'ناوي',
                    description: 'هدفك في هذا الأسبوع​٤٠ دقيقة مشي ​لا تنسَ ​ تمارين الاستطالة والإحماء​​',
                    start: '20241231T090000Z',
                    end: '20241231T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: '3 عناصر تؤثر على أدائك في التمرين:​ -نومك​ -تغذيتك خلال اليوم​ -شربك للماء​',
                    start: '20240104T090000Z',
                    end: '20240104T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: ':زود دقيقتين على هدفك يابطل وامش ٤٢ دقائق ',
                    start: '20240107T090000Z',
                    end: '20240107T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'جمعة مباركة🤍​كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240112T090000Z',
                    end: '20240112T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: ':جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٤٥ د​ ٣ أيام بالأسبوع ',
                    start: '20240114T090000Z',
                    end: '20240114T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: ':لا تنسَ تشرب ماء ، قبل تمشي اليوم ',
                    start: '20240116T090000Z',
                    end: '20240116T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: ':جرّب تروح اليوم مع عائلتك إلى الحديقة ​',
                    start: '20240119T090000Z',
                    end: '20240119T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'استمر على هدفك يابطل​ وامش ٤٥ دقائق​',
                    start: '20240121T090000Z',
                    end: '20240121T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'خذ لك بريك ١٠ دقائق من تمارين التمدد',
                    start: '20240123T090000Z',
                    end: '20240123T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                    start: '20240126T090000Z',
                    end: '20240126T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٤٨​                            ',
                    start: '20240128T090000Z',
                    end: '20240128T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'صباحك صحة وإنجاز 🤩❤️​ حافظ على صحتك واستمر بتحقيق خطواتك! 🤩​',
                    start: '20240201T090000Z',
                    end: '20240228T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!​ هدفك في هذا الأسبوع​ ٥٠ دقيقة مشي ٣  ايام بالأسبوع​',
                    start: '20240204T090000Z',
                    end: '20240204T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'صباحك نشاط وصحة ​1. اختر الحذاء المناسب👟 ​ 2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​',
                    start: '20240206T090000Z',
                    end: '20240206T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'اجمع الاثنين!​ اقضِ وقتك مع احبابك ، ومارسوا الرياضة معا.​',
                    start: '20240209T090000Z',
                    end: '20240209T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٢      ',
                    start: '20240211T090000Z',
                    end: '20240211T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'استمر على هدفك يابطل وامش ٥٢ دقائق ٣ ايام بالأسبوع​',
                    start: '20240218T090000Z',
                    end: '20240218T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​                            ',
                    start: '20240220T090000Z',
                    end: '20240220T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'تحدى نفسك اليوم! ​جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                    start: '20240223T090000Z',
                    end: '20240223T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                    start: '20240225T090000Z',
                    end: '20240225T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي ',
                    start: '20240228T090000Z',
                    end: '20240228T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'هدفك في هذا الأسبوع​ الاستمرار على ٥٥ دقيقة مشي ​ مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​',
                    start: '20240303T090000Z',
                    end: '20240303T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'جاء الوقت ارفع هدفك ​ دقيقتين وخلها ٥٧',
                    start: '20240310T090000Z',
                    end: '20240310T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: ':رمضان كريم🤍​خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                    start: '20240312T090000Z',
                    end: '20240312T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'تذكر المشي إلى المسجد صحة وأجر​',
                    start: '20240314T090000Z',
                    end: '20240314T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'زود ٣ دقائق على هدفك يابطل وامش ٦٠ دقائق ​',
                    start: '20240317T090000Z',
                    end: '20240317T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240319T090000Z',
                    end: '20240319T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​ جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240322T090000Z',
                    end: '20240322T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د، ٣ايام بالأسبوع​',
                    start: '20240324T090000Z',
                    end: '20240324T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                    start: '20240328T090000Z',
                    end: '20240328T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'مبرووووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​ إنجاز يفتخر فيه فلا تنسَ تكافئ نفسك  👏🏻​وبهذه المناسبة بنغير أسلوب تحدي للشهر الجاي​',
                    start: '20240331T090000Z',
                    end: '20240331T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: "قطعنا مشوار طويل وممتع مع بعض ووصلنا للأسبوع رقم ٣٤ من تحقيق الخطوات والإنجازا🎖️❤️​لذلك الشهر هذا بنرفع الحماس وعدد الأيام ​  مستعد؟! 🤩​",
                    start: '20240401T090000Z',
                    end: '20240401T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "هدفك في هذا الأسبوع​ مشي مابين ٣٠ إلى ٦٠ دقيقة باليوم،  ٤ ايام بالاسبوع​",
                    start: '20240402T090000Z',
                    end: '20240402T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "كيف تتعامل مع آلام العضلات​ بعد التمرين؟​ - أكثر من السوائل.​ - مارس بعض تمارين الإطالة الخفيفة.​ - جرب الكمادات الدافئة أو الثلج لتخفيف الألم.​- جرب الجاكوزي وقم بتدليك مكان الألم.​",
                    start: '20240404T090000Z',
                    end: '20240404T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع     ",
                    start: '20240407T090000Z',
                    end: '20240407T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: ":لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​",
                    start: '20240408T090000Z',
                    end: '20240408T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "صباحك صحة،​ كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​",
                    start: '20240412T090000Z',
                    end: '20240412T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "كمل على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع  ",
                    start: '20240414T090000Z',
                    end: '20240414T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                    start: '20240416T090000Z',
                    end: '20240416T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟  2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​210:استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع",
                    start: '20240419T090000Z',
                    end: '20240419T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع     ​",
                    start: '20240421T090000Z',
                    end: '20240421T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "كفو عليك وصلت لآخر أسبوع​  بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع​",
                    start: '20240428T090000Z',
                    end: '20240428T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: "جمعة مباركة🤍​       كم خطوة مشيت اليوم؟ شاركنا  على #امش30​",
                    start: '20240503T090000Z',
                    end: '20240503T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: "هدفك في هذا الأسبوع​  مشي مابين ٣٠ إلى ٧٠ دقيقة باليوم،  ٥ ايام بالاسبوع​",
                    start: '20240505T090000Z',
                    end: '20240505T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                    start: '20240510T090000Z',
                    end: '20240510T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: "كمل على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع     ​",
                    start: '20240512T090000Z',
                    end: '20240512T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: '​صباحك نشاط وحركة   ‏كل خطوة تمشيها تنعكس على صحتك، لا ينتهي يومك بدون مشي​',
                    start: '20240517T090000Z',
                    end: '20240517T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                    start: '20240519T090000Z',
                    end: '20240519T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'إذا كنت مشغول اليوم جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240521T090000Z',
                    end: '20240521T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'خلنا معك وأنت تمشي 🏃🏻، ​  واسمع  بودكاست #عش_بصحة 🎧​ https://bit.ly/3uGoNwI​',
                    start: '20240523T090000Z',
                    end: '20240523T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'كفو عليك وصلت لآخر أسبوع​   بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                    start: '20240526T090000Z',
                    end: '20240526T100000Z',
                    location: '',
                },


                {
                    title: 'ناوي',
                    description: 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️ فخورين فيك حققت انجاز عظيم بـ١٠ شهور بس قدرت تبدأ من الصفر حتى ٦٠ دقيقة مشي!!​ بهذه المناسبة هدفك هذا الشهر بيكون مختلف،أنت تحدده، عندك خيارين: تزيد المدة أو الأيام  أو تحافظ على مستواك​  مستعد!؟🤩❤️​',
                    start: '20240601T090000Z',
                    end: '20240601T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'حدد خطتك وأهدافك لهذا الشهر كامل ​وانطلق!!🏃🏻‍♂️​',
                    start: '20240602T090000Z',
                    end: '20240602T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​•  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                    start: '20240604T090000Z',
                    end: '20240604T100000Z',
                    location: '',
                },
             
                {
                    title: 'ناوي',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240609T090000Z',
                    end: '20240609T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'حددت خطتك وطبقتها؟ كل اللي عليك تراقب أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك.​',
                    start: '20240612T090000Z',
                    end: '20240612T100000Z',
                    location: '',
                },

                {
                    title: 'ناوي',
                    description: 'كيف تستمر على اتباع سلوك المشي؟ ​  -بسط السلوك، قسم المشي على دفعات على مدار اليوم​  - اصنع  بيئة محفزة. ​ -اجعل الإشارة واضحة، استخدم تطبيقات تتبّع العادات أو منبه لتذكيرك ​',
                    start: '20240617T090000Z',
                    end: '20240617T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'صباحك صحة،​ كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240621T090000Z',
                    end: '20240621T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'تابع تقدمك واستعد للتحديات، كن مرن ولا تخف من تعديل أو تغيير خططك وأهدافك عند مواجهة عقبات أو صعوبات ​',
                    start: '20240625T090000Z',
                    end: '20240625T100000Z',
                    location: '',
                },
                {
                    title: 'ناوي',
                    description: 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الكرة بملعبك الآن، صار عندك القدرة والمهارات لممارسة المشي والمحافظة عليه​ استمر ولا توقف 🏃🏻‍♂️💪🏼​',
                    start: '20240630T090000Z',
                    end: '20240630T100000Z',
                    location: '',
                },

               



          
             

                

               
            ];
        }

        else if (totalValue >= 6 && totalValue <= 12) {
            events = [

                {
                    title: 'بادي',
                    description: ':شهر جديد وإنجازات جديدة  كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله​',
                    start: '20231101T090000Z',
                    end: '20231101T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'هدفك في هذا الأسبوع​٢٢ دقيقة مشي  ٣ أيام بالأسبوع​ لا تنسَ ​ تمارين التمدد ',
                    start: '20231105T090000Z',
                    end: '20231105T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'قيس تطور أدائك، تابع  نبضات قلبك، مدة تمرينك و مدى لياقتك.​       ​',
                    start: '20231107T090000Z',
                    end: '20231107T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'تحدى نفسك وأصدقائك،  مين عنده اللياقة أعلى ؟​  تقدرون تستخدمون تطبيق صحتي لحساب عدد الخطوات​',
                    start: '20231110T090000Z',
                    end: '20231110T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'زود دقيقتين على هدفك يابطل  وامش ٢٤ دقائق ​',
                    start: '20231112T090000Z',
                    end: '20231112T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​ ‏وجمعتك مباركة​',
                    start: '20231117T090000Z',
                    end: '20231117T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جاء الوقت ارفع هدفك وزود​    ٣ دقائق وخلها ٢٧       ​',
                    start: '20231119T090000Z',
                    end: '20231119T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'الجو جميل وكل بخاطرة يمشي جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                    start: '20231124T090000Z',
                    end: '20231124T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'كفو عليك وصلت لآخر أسبوع​  بهذا الشهر زودها  ٣ دقائق ​   وخلها ٣٠​',
                    start: '20231126T090000Z',
                    end: '20231126T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'مبروووك ... وصلت لـ٣٠ دقيقة 🎉 👏🏻 ​ كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​',
                    start: '20231130T090000Z',
                    end: '20231130T100000Z',
                },

                {
                    title: 'بادي',
                    description: 'هدفك في هذا الأسبوع​33 دقيقة مشي ​لا تنسَ ​ تمارين الاستطالة والإحماء​',
                    start: '20231203T090000Z',
                    end: '20231203T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'صباحك صحّة ✋، ​ ‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                    start: '20231208T090000Z',
                    end: '20231208T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'زود دقيقتين على هدفك يابطل وامش 35 دقيقة​',
                    start: '20231210T090000Z',
                    end: '20231210T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جرب توقف اليوم بعيد، وكملها مشي للدوام.​',
                    start: '20231212T090000Z',
                    end: '20231212T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20231215T090000Z',
                    end: '20231215T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'ارفع هدفك يا بطل وامش  ٣٨دقيقة  ٣ ايام بالأسبوع                ​',
                    start: '20231217T090000Z',
                    end: '20231217T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'ارفع هدفك يا بطل وامش  ٣٨دقيقة  ٣ ايام بالأسبوع                ​',
                    start: '20231222T090000Z',
                    end: '20231222T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر  زودها دقيقتين وخلها  ٤٠د ​',
                    start: '20231224T090000Z',
                    end: '20231224T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'تحس عضلاتك شاده؟ لا تنسَ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                    start: '20231226T090000Z',
                    end: '20231226T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!​',
                    start: '20231229T090000Z',
                    end: '20231229T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'هدفك في هذا الأسبوع​٤٢ دقيقة مشي ​لا تنسَ ​تمارين الاستطالة والإحماء​',
                    start: '20231231T090000Z',
                    end: '20231231T100000Z',
                },

                {
                    title: 'بادي',
                    description: ' 3 عناصر تؤثر على أدائك في التمرين:​-نومك​ -تغذيتك خلال اليوم​ -شربك للماء​',
                    start: '20240104T090000Z',
                    end: '20240104T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'زود دقيقتين على هدفك يابطل وامش ٤٤ دقيقة ​',
                    start: '20240107T090000Z',
                    end: '20240107T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جمعة مباركة🤍​ كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240112T090000Z',
                    end: '20240112T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٤٧ دقيقة​',
                    start: '20240114T090000Z',
                    end: '20240114T100000Z',
                },
                {
                    title: 'بادي',
                    description: ' 3 عناصر تؤثر على أدائك في التمرين:​-نومك​ -تغذيتك خلال اليوم​ -شربك للماء​',
                    start: '20240131T090000Z',
                    end: '20240131T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240116T090000Z',
                    end: '20240116T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                    start: '20240119T090000Z',
                    end: '20240119T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'استمر على هدفك يابطل​ وامش ٤٧ دقيقة، ٣ ايام بالأسبوع ​',
                    start: '20240121T090000Z',
                    end: '20240121T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                    start: '20240126T090000Z',
                    end: '20240126T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٠دقيقة​',
                    start: '20240128T090000Z',
                    end: '20240128T100000Z',
                },

                {
                    title: 'بادي',
                    description: 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!هدفك في هذا الأسبوع ٥٠ دقيقة مشي ٣  ايام بالأسبوع​',
                    start: '20240204T090000Z',
                    end: '20240204T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'صباحك نشاط وصحة ​1. اختر الحذاء المناسب👟 ​2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​',
                    start: '20240206T090000Z',
                    end: '20240206T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'اجمع الاثنين!​   اقضِ وقتك مع أطفالك ، ومارسوا الرياضة معا.​',
                    start: '20240209T090000Z',
                    end: '20240209T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٢                 ​',
                    start: '20240211T090000Z',
                    end: '20240211T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'صباحك صحة وإنجاز 🤩❤️​    المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​',
                    start: '20240214T090000Z',
                    end: '20240214T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'استمر على هدفك يابطل​  وامش ٥٢ دقائق ٣ ايام بالأسبوع​',
                    start: '20240218T090000Z',
                    end: '20240218T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​',
                    start: '20240220T090000Z',
                    end: '20240220T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'تحدى نفسك اليوم! ​   جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                    start: '20240223T090000Z',
                    end: '20240223T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                    start: '20240225T090000Z',
                    end: '20240225T100000Z',
                },



                {
                    title: 'بادي',
                    description: 'هدفك في هذا الأسبوع​ الاستمرار على ٥٥ دقيقة مشي  مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​',
                    start: '20240303T090000Z',
                    end: '20240303T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'جاء الوقت ارفع هدفك ​دقيقتين وخلها 57 دقيقة.            ​',
                    start: '20240310T090000Z',
                    end: '20240310T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'رمضان كريم🤍​ خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                    start: '20240312T090000Z',
                    end: '20240312T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'تذكر المشي إلى المسجد صحة وأجر​',
                    start: '20240314T090000Z',
                    end: '20240314T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'زود ٣ دقائق على هدفك يابطل وامش ٦٠ دقيقة ​',
                    start: '20240317T090000Z',
                    end: '20240317T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​  جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240322T090000Z',
                    end: '20240322T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د، ٣ايام بالأسبوع​',
                    start: '20240324T090000Z',
                    end: '20240324T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                    start: '20240327T090000Z',
                    end: '20240327T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'مبرووووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​       إنجاز يفتخر فيه فلا تنسَ تكافئ نفسك  👏🏻​ وبهذه المناسبة بنغير أسلوب تحدي للشهر الجاي​',
                    start: '20240331T090000Z',
                    end: '20240331T100000Z',
                },


                {
                    title: 'بادي',
                    description: 'قطعنا مشوار طويل وممتع مع بعض ووصلنا للأسبوع رقم ٣٤ من تحقيق الخطوات والأهداف  🎖️❤️​ لذلك الشهر هذا بنرفع الحماس وعدد الأيام ​ مستعد؟! 🤩​',
                    start: '20240401T090000Z',
                    end: '20240401T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "هدفك في هذا الأسبوع​ مشي مابين ٣٠ إلى ٦٠ دقيقة باليوم،  ٤ ايام بالاسبوع​",
                    start: '20240402T090000Z',
                    end: '20240402T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: ":لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​",
                    start: '20240408T090000Z',
                    end: '20240408T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع     ",
                    start: '20240407T090000Z',
                    end: '20240428T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: 'صباحك صحة، كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240412T090000Z',
                    end: '20240412T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "كمل على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع  ",
                    start: '20240414T090000Z',
                    end: '20240414T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                    start: '20240416T090000Z',
                    end: '20240416T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟  2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​210:استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع",
                    start: '20240419T090000Z',
                    end: '20240419T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع     ​",
                    start: '20240421T090000Z',
                    end: '20240421T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: 'أحرص على ممارسة تمارين  تقوية العضلات 💪 ​على الأقل مرتين في الأسبوع​',
                    start: '20240427T090000Z',
                    end: '20240427T100000Z',
                },
                
                {
                    title: 'بادي',
                    description: "كفو عليك وصلت لآخر أسبوع​  بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع​",
                    start: '20240428T090000Z',
                    end: '20240428T100000Z',
                },
                
                
                {
                    title: 'بادي',
                    description: "جمعة مباركة🤍​       كم خطوة مشيت اليوم؟ شاركنا  على #امش30​",
                    start: '20240503T090000Z',
                    end: '20240503T100000Z',
                },
                {
                    title: 'بادي',
                    description: "هدفك في هذا الأسبوع​  مشي مابين ٣٠ إلى ٧٠ دقيقة باليوم،  ٥ ايام بالاسبوع​",
                    start: '20240505T090000Z',
                    end: '20240505T100000Z',
                },
                {
                    title: 'بادي',
                    description: "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                    start: '20240510T090000Z',
                    end: '20240510T100000Z',
                },
                {
                    title: 'بادي',
                    description: "كمل على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع     ​",
                    start: '20240512T090000Z',
                    end: '20240512T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'غير مكان مشيك المعتاد اطلع لحديقة أو سوق أو امش في البيت ​',
                    start: '20240514T090000Z',
                    end: '20240514T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'صباحك نشاط وحركة ​ كل خطوة تمشيها تنعكس على صحتك، لا ينتهي يومك بدون مشي​ ',
                    start: '20240517T090000Z',
                    end: '20240517T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                    start: '20240519T090000Z',
                    end: '20240519T100000Z',
                },
                 {
                    title: 'بادي',
                    description: 'إذا كنت مشغول اليوم جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240521T090000Z',
                    end: '20240521T100000Z',
                },
                 {
                    title: 'بادي',
                    description: 'كفو عليك وصلت لآخر أسبوع​   بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                    start: '20240526T090000Z',
                    end: '20240526T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240529T090000Z',
                    end: '20240529T100000Z',
                },


                {
                    title: 'بادي',
                    description: 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️ فخورين فيك حققت انجاز عظيم بـ١٠ شهور بس قدرت تبدأ من الصفر حتى ٦٠ دقيقة مشي!!​ بهذه المناسبة هدفك هذا الشهر بيكون مختلف،أنت تحدده، عندك خيارين: تزيد المدة أو الأيام  أو تحافظ على مستواك​  مستعد!؟🤩❤️​',
                    start: '20240601T090000Z',
                    end: '20240601T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'حدد خطتك وأهدافك لهذا الشهر كامل ​وانطلق!!🏃🏻‍♂️​',
                    start: '20240602T090000Z',
                    end: '20240602T100000Z',
                },
                {
                    title: 'بادي',
                    description: '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​•  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                    start: '20240604T090000Z',
                    end: '20240604T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240609T090000Z',
                    end: '20240609T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'حددت خطتك وطبقتها؟ كل اللي عليك تراقب أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك.​',
                    start: '20240612T090000Z',
                    end: '20240612T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'صباحك صحة،​ كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240621T090000Z',
                    end: '20240621T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'تابع تقدمك واستعد للتحديات، كن مرن ولا تخف من تعديل أو تغيير خططك وأهدافك عند مواجهة عقبات أو صعوبات ​',
                    start: '20240625T090000Z',
                    end: '20240625T100000Z',
                },
                {
                    title: 'بادي',
                    description: 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الكرة بملعبك الآن، صار عندك القدرة والمهارات لممارسة المشي والمحافظة عليه',
                    start: '20240630T090000Z',
                    end: '20240630T100000Z',
                },
            ]
        }
        else if (totalValue >= 18 && totalValue <= 26) {
            events = [
                {
                    title: 'منطلق',
                    description: ' شهر جديد وتحديات جديدة​ جرب تحدى نفسك وأصدقائك، مين عنده اللياقة أعلى ؟​    تقدر تستخدم تطبيق صحتي لحساب عدد الخطوات​​',
                    start: '20231101T090000Z',
                    end: '20231101T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'هدفك في هذا الأسبوع​36 دقيقة مشي  ٣ أيام بالأسبوع​ لا تنسَ ​ تمارين التمدد ',
                    start: '20231105T090000Z',
                    end: '20231105T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'قيس تطور أدائك، تابع  نبضات قلبك، مدة تمرينك و مدى لياقتك.​       ​',
                    start: '20231107T090000Z',
                    end: '20231107T100000Z',
                },
             
                {
                    title: 'منطلق',
                    description: 'زود دقيقتين على هدفك يابطل  وامش 38 دقائق ​',
                    start: '20231112T090000Z',
                    end: '20231112T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​ ‏وجمعتك مباركة​',
                    start: '20231117T090000Z',
                    end: '20231117T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جاء الوقت ارفع هدفك وزود​    ٣ دقائق وخلها 40       ​',
                    start: '20231119T090000Z',
                    end: '20231119T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'الجو جميل وكل بخاطرة يمشي جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                    start: '20231124T090000Z',
                    end: '20231124T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كفو عليك وصلت لآخر أسبوع​  بهذا الشهر زودها  ٣ دقائق ​   وخلها 43​',
                    start: '20231126T090000Z',
                    end: '20231126T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​​',
                    start: '20231128T090000Z',
                    end: '20231128T100000Z',
                },



                {
                    title: 'منطلق',
                    description: "شهر جديد وإنجازات جديدة كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله",
                    start: '20231201T090000Z',
                    end: '20231201T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'هدفك في هذا الأسبوع​    ٤٥ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                    start: '20231203T090000Z',
                    end: '20231203T100000Z',
                },
                {
                    title: 'منطلق',
                    description: ':قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20231205T090000Z',
                    end: '20231205T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'صباحك صحّة ✋، ​ ‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                    start: '20231208T090000Z',
                    end: '20231208T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'استمر على ٤٥ دقيقة ​',
                    start: '20231210T090000Z',
                    end: '20231210T100000Z',
                },
                {
                    title: 'منطلق',
                    description: '‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​',
                    start: '20231215T090000Z',
                    end: '20231215T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٣٥         ',
                    start: '20231217T090000Z',
                    end: '20231217T100000Z',
                },
                {
                    title: 'منطلق',
                    description: ':كيف تستمر وتحافظ على سلوك المشي؟​ • غير بيئتك المحيطة، أو كن مؤثرا فيهم .• زود الحركة بتفاصيل يومك​ • غير مكان مشيك من فترة لفترة​ • امشِ مع أحد تحبه.​',
                    start: '20231219T090000Z',
                    end: '20231219T100000Z',
                },
                {
                    title: 'منطلق',
                    description: "بشر، حققت الهدف هذا الأسبوع ؟🤩​في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​",
                    start: '20231222T090000Z',
                    end: '20231222T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر  ٣٨دقيقة في ٣ايام بالأسبوع​',
                    start: '20231224T090000Z',
                    end: '20231224T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                    start: '20231226T090000Z',
                    end: '20231226T100000Z',
                },
                  {
                    title: 'منطلق',
                    description: 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!​',
                    start: '20231229T090000Z',
                    end: '20231229T100000Z',
                },

                {
                    title: 'منطلق',
                    description: 'هدفك في هذا الأسبوع​  ٥٠ دقيقة مشي لا تنسَ تمارين الاستطالة والإحماء​​',
                    start: '20240101T090000Z',
                    end: '20240101T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                    start: '20240104T090000Z',
                    end: '20240104T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'زود دقيقتين على هدفك يابطل وامش 52 دقيقة ​',
                    start: '20240107T090000Z',
                    end: '20240107T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'سمعت حلقة بودكاست الجديدة من (عش بصحة )؟​ لا تفوتك ، حملها واسمعها، وأنت تمشي​',
                    start: '20240109T090000Z',
                    end: '20240109T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جمعة مباركة🤍​ كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240112T090000Z',
                    end: '20240112T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'استمر على هدفك يابطل​ وامش ٥٢ د ٣ ايام بالأسبوع ​',
                    start: '20240114T090000Z',
                    end: '20240114T100000Z',
                },
        
                {
                    title: 'منطلق',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240116T090000Z',
                    end: '20240116T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                    start: '20240119T090000Z',
                    end: '20240119T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'استمر على هدفك يابطل​ وامش 52 دقيقة، ٣ ايام بالأسبوع ​',
                    start: '20240121T090000Z',
                    end: '20240121T100000Z',
                },
                {
                    title: 'منطلق',
                    description:'خذ لك بريك ١٠ دقائق من تمارين التمدد​​',
                    start: '20240125T090000Z',
                    end: '20240125T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها 55دقيقة​',
                    start: '20240128T090000Z',
                    end: '20240128T100000Z',
                },

                
                {
                    title: 'منطلق',
                    description: 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!هدفك في هذا الأسبوع 55 دقيقة مشي ٣  ايام بالأسبوع​',
                    start: '20240204T090000Z',
                    end: '20240204T100000Z',
                },
               
                {
                    title: 'منطلق',
                    description: 'اجمع الاثنين!​   اقضِ وقتك مع أطفالك ، ومارسوا الرياضة معا.​',
                    start: '20240209T090000Z',
                    end: '20240209T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'استمر على هدفك يابطل​ وامش ٥٥ دقائق ٣ ايام بالأسبوع              ​ ​',
                    start: '20240211T090000Z',
                    end: '20240211T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'صباحك صحة وإنجاز 🤩❤️​    المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​',
                    start: '20240214T090000Z',
                    end: '20240214T100000Z',
                },
                {
                    title: 'منطلق',
                    description: '​ جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٧   ​​',
                    start: '20240218T090000Z',
                    end: '20240218T100000Z',
                },
           
                {
                    title: 'منطلق',
                    description: 'تحدى نفسك اليوم! ​   جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                    start: '20240223T090000Z',
                    end: '20240223T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها 60​',
                    start: '20240225T090000Z',
                    end: '20240225T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'مبروووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​ كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​​',
                    start: '20240229T090000Z',
                    end: '20240229T100000Z',
                },


                
                {
                    title: 'منطلق',
                    description: 'هدفك في هذا الشهر   الاستمرار على ٦٠ دقيقة مشي لكن ٤ أيام بالأسبوع​',
                    start: '20240303T090000Z',
                    end: '20240303T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'استمر على ٦٠ دقيقة مشي ٤ أيام بالأسبوع​',
                    start: '20240310T090000Z',
                    end: '20240310T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'رمضان كريم🤍​ خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                    start: '20240312T090000Z',
                    end: '20240312T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'حمل كتاب صوتي أو بودكاست وأنطلق 🏃🏻‍♂️​',
                    start: '20240314T090000Z',
                    end: '20240314T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240319T090000Z',
                    end: '20240319T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​  جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240322T090000Z',
                    end: '20240322T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د ٤ايام بالأسبوع​',
                    start: '20240324T090000Z',
                    end: '20240324T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'تذكر المشي إلى المسجد صحة وأجر​',
                    start: '20240326T090000Z',
                    end: '20240326T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                    start: '20240329T090000Z',
                    end: '20240329T100000Z',
                },

                
                {
                    title: 'منطلق',
                    description: 'قطعنا مشوار طويل وممتع مع بعض ووصلنا للأسبوع رقم ٣٤ من تحقيق الخطوات والأهداف  🎖️❤️​ لذلك الشهر هذا بنرفع الحماس وعدد الأيام ​ مستعد؟! 🤩​',
                    start: '20240401T090000Z',
                    end: '20240401T100000Z',
                },
                
                {
                    title: 'منطلق',
                    description: "حدد خطتك وأهدافك لهذا لمدة ٣ شهور وانطلق!!🏃🏻‍♂️​",
                    start: '20240402T090000Z',
                    end: '20240402T100000Z',
                },
                {
                    title: 'منطلق',
                    description: '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​•  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                    start: '20240403T090000Z',
                    end: '20240403T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240405T090000Z',
                    end: '20240405T100000Z',
                },
                
                {
                    title: 'منطلق',
                    description: ":لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​",
                    start: '20240408T090000Z',
                    end: '20240408T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'صباحك صحة، كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240412T090000Z',
                    end: '20240412T100000Z',
                },
                
                
                {
                    title: 'منطلق',
                    description: "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                    start: '20240416T090000Z',
                    end: '20240416T100000Z',
                },
                
                {
                    title: 'منطلق',
                    description: "صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟  2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​210:استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع",
                    start: '20240419T090000Z',
                    end: '20240419T100000Z',
                },
                
                {
                    title: 'منطلق',
                    description: 'وصلت لآخر أسبوع بهذا الشه     لا تنسَ  تتابع تقدمك واستعد للتحديات​',
                    start: '20240421T090000Z',
                    end: '20240421T100000Z',
                },
              
                
                {
                    title: 'منطلق',
                    description: 'صباحك صحة وإنجاز 🤩❤️​    كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240428T090000Z',
                    end: '20240428T100000Z',
                },


                {
                    title: 'منطلق',
                    description: 'شهر جديد وخطوات جديدة 🤩​    هدفك هذا الشهر تحديد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك أو إخوانك، مثل المشي -القفز على الحبل- الدراجات- كرة قدم- لعبة البادل​',
                    start: '20240501T090000Z',
                    end: '20240501T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'تابع تقدمك واستعد للتحديات، كن مرن، لا تخف من تغيير خطتك أو اهدافك عند مواجهة عقبات أو صعوبات ​',
                    start: '20240507T090000Z',
                    end: '20240507T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جمعة مباركة🤍 كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240510T090000Z',
                    end: '20240510T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'غير مكان مشيك المعتاد اطلع لحديقة أو سوق أو امش في البيت ​',
                    start: '20240514T090000Z',
                    end: '20240514T100000Z',
                },
                {
                    title: 'منطلق',
                    description: "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                    start: '20240517T090000Z',
                    end: '20240517T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240519T090000Z',
                    end: '20240519T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جرب نشاط جديد مع والديك أو أطفالك وشاركنا على هاشتاق #امش٣٠​',
                    start: '20240525T090000Z',
                    end: '20240525T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240530T090000Z',
                    end: '20240530T100000Z',
                },


                {
                    title: 'منطلق',
                    description: 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️​ وما يحتاج نوصيك اكتب خطتك وأهدافك للسنة القادمة ولا تنسَ اللي حولك وكون قدوة لهم​',
                    start: '20240601T090000Z',
                    end: '20240601T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'أحرص على ممارسة تمارين  تقوية العضلات 💪 ​ على الأقل مرتين في الأسبوع​',
                    start: '20240604T090000Z',
                    end: '20240604T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'كيف تتعامل مع آلام العضلات​ بعد التمرين؟​ - أكثر من السوائل.​ - مارس بعض تمارين الإطالة الخفيفة.​ - جرب الكمادات الدافئة أو الثلج لتخفيف الألم.​ - جرب الجاكوزي وقم بتدليك مكان الألم.​',
                    start: '20240612T090000Z',
                    end: '20240612T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'صباحك صحة،​  كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240617T090000Z',
                    end: '20240617T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'لا تنسَ تمارين الاستطالة والإحماء​',
                    start: '20240624T090000Z',
                    end: '20240624T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'جرب رياضة اخرى اليوم غير المشي ​ اسبح - ارفع اثقال- جرب الدراجة- يوغا​',
                    start: '20240628T090000Z',
                    end: '20240628T100000Z',
                },
                {
                    title: 'منطلق',
                    description: 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الآن دورك تكمل وتكون قدوة للي حولك ما يحتاج نوصيك شاركهم متعة المشي واستمر ولا توقف 🏃🏻‍♂️💪🏼​',
                    start: '20240630T090000Z',
                    end: '20240630T100000Z',
                },
              


               
              

            ]
        }

        else if (totalValue >= 30 && totalValue <= 50) {
            events = [
                {
                    title: 'محترف',
                    description: ' شهر جديد وتحديات جديدة​ جرب تحدى نفسك وأصدقائك، مين عنده اللياقة أعلى ؟​    تقدر تستخدم تطبيق صحتي لحساب عدد الخطوات​​',
                    start: '20231101T090000Z',
                    end: '20231101T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'هدفك في هذا الأسبوع​36 دقيقة مشي لا تنسَ ​ تمارين التمدد ',
                    start: '20231105T090000Z',
                    end: '20231105T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'قيس تطور أدائك، تابع  نبضات قلبك، مدة تمرينك و مدى لياقتك.​       ​',
                    start: '20231107T090000Z',
                    end: '20231107T100000Z',
                },
             
                {
                    title: 'محترف',
                    description: 'زود دقيقتين على هدفك يابطل  وامش 38 دقائق ​',
                    start: '20231112T090000Z',
                    end: '20231112T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​ ‏وجمعتك مباركة​',
                    start: '20231117T090000Z',
                    end: '20231117T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جاء الوقت ارفع هدفك وزود​    ٣ دقائق وخلها 40       ​',
                    start: '20231119T090000Z',
                    end: '20231119T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'الجو جميل وكل بخاطرة يمشي جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                    start: '20231124T090000Z',
                    end: '20231124T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كفو عليك وصلت لآخر أسبوع​  بهذا الشهر زودها  ٣ دقائق ​   وخلها 43​',
                    start: '20231126T090000Z',
                    end: '20231126T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​​',
                    start: '20231128T090000Z',
                    end: '20231128T100000Z',
                },

  {
                    title: 'محترف',
                    description: "شهر جديد وإنجازات جديدة كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله",
                    start: '20231201T090000Z',
                    end: '20231201T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'هدفك في هذا الأسبوع​    ٤٥ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                    start: '20231203T090000Z',
                    end: '20231203T100000Z',
                },
                {
                    title: 'محترف',
                    description: ':قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20231205T090000Z',
                    end: '20231205T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'صباحك صحّة ✋، ​ ‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                    start: '20231208T090000Z',
                    end: '20231208T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'استمر على ٤٥ دقيقة ​',
                    start: '20231210T090000Z',
                    end: '20231210T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'بشر، حققت الهدف هذا الأسبوع ؟🤩​  في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​​',
                    start: '20231215T090000Z',
                    end: '20231215T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها 47         ',
                    start: '20231217T090000Z',
                    end: '20231217T100000Z',
                },
             
                {
                    title: 'محترف',
                    description: '‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​',
                    start: '20231221T090000Z',
                    end: '20231221T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كفو عليك وصلت لآخر اسبوع بهذا الشهر زودها ٣ دقائق بس! وخلها ٥٠​',
                    start: '20231224T090000Z',
                    end: '20231224T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                    start: '20231226T090000Z',
                    end: '20231226T100000Z',
                },
                  {
                    title: 'محترف',
                    description: 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!​',
                    start: '20231229T090000Z',
                    end: '20231229T100000Z',
                },

                {
                    title: 'محترف',
                    description: 'هدفك في هذا الأسبوع​    ٥٠ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                    start: '20240101T090000Z',
                    end: '20240101T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                    start: '20240104T090000Z',
                    end: '20240104T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'زود دقيقتين على هدفك يابطل وامش 52 دقيقة ​',
                    start: '20240107T090000Z',
                    end: '20240107T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جمعة مباركة🤍​ كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240112T090000Z',
                    end: '20240112T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'استمر على هدفك يابطل​ وامش 52 دقائق​',
                    start: '20240114T090000Z',
                    end: '20240114T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240116T090000Z',
                    end: '20240116T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جرّب تروح اليوم مع أطفال عائلتك إلى الحديقة ​',
                    start: '20240119T090000Z',
                    end: '20240119T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'استمر على هدفك يابطل​  وامش ٥٢ د ٣ ايام بالأسبوع ​',
                    start: '20240121T090000Z',
                    end: '20240121T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                    start: '20240128T090000Z',
                    end: '20240128T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                    start: '20240128T090000Z',
                    end: '20240128T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                    start: '20240131T090000Z',
                    end: '20240131T100000Z',
                },

                
                {
                    title: 'محترف',
                    description: 'قوة عضلاتك، تعديل مزاجك، توازن جسمك، ولياقة قلبك، كلها تعتمد على نشاطك البدني​',
                    start: '20240202T090000Z',
                    end: '20240202T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!هدفك في هذا الأسبوع 55 دقيقة مشي ٣  ايام بالأسبوع​',
                    start: '20240204T090000Z',
                    end: '20240204T100000Z',
                },
               
                {
                    title: 'محترف',
                    description: 'اجمع الاثنين!​   اقضِ وقتك مع أطفالك ، ومارسوا الرياضة معا.​',
                    start: '20240209T090000Z',
                    end: '20240209T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'استمر على هدفك يابطل​ وامش ٥٥ دقائق ٣ ايام بالأسبوع              ​ ​',
                    start: '20240211T090000Z',
                    end: '20240211T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'صباحك صحة وإنجاز 🤩❤️​    المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​',
                    start: '20240214T090000Z',
                    end: '20240214T100000Z',
                },
                {
                    title: 'محترف',
                    description: '​ جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٧   ​​',
                    start: '20240218T090000Z',
                    end: '20240218T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​',
                    start: '20240220T090000Z',
                    end: '20240220T100000Z',
                },
           
                {
                    title: 'محترف',
                    description: 'تحدى نفسك اليوم! ​   جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                    start: '20240223T090000Z',
                    end: '20240223T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذه الشهر زودها  ٣ دقائق وخلها ٦٠​',
                    start: '20240225T090000Z',
                    end: '20240225T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'مبروووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​ كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​​',
                    start: '20240229T090000Z',
                    end: '20240229T100000Z',
                },

                {
                    title: 'محترف',
                    description: 'هدفك في هذا الشهر   الاستمرار على ٦٠ دقيقة مشي لكن ٤ أيام بالأسبوع​',
                    start: '20240303T090000Z',
                    end: '20240303T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'حمل كتاب صوتي أو بودكاست وأنطلق 🏃🏻‍♂️​',
                    start: '20240306T090000Z',
                    end: '20240306T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'استمر على ٦٠ دقيقة مشي ٤ أيام بالأسبوع​',
                    start: '20240310T090000Z',
                    end: '20240310T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'رمضان كريم🤍​ خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                    start: '20240312T090000Z',
                    end: '20240312T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​ جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                    start: '20240315T090000Z',
                    end: '20240315T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240319T090000Z',
                    end: '20240319T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                    start: '20240322T090000Z',
                    end: '20240322T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د ٤ايام بالأسبوع​',
                    start: '20240324T090000Z',
                    end: '20240324T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'تذكر المشي إلى المسجد صحة وأجر​',
                    start: '20240327T090000Z',
                    end: '20240327T100000Z',
                },
            
            

                {
                    title: 'محترف',
                    description: 'وصلنا للأسبوع رقم ٣٠ من تحقيق الإنجازات والأهداف 🎖️❤️بهذه المناسبة هدفنا هذه ٣ شهور بيكون غير،​أنت اللي تحدده، بيكون عندك خيارين يا تزيد المدة أو يوم أو المحافظة على مستواك.​مستعد!؟🤩​',
                    start: '20240401T090000Z',
                    end: '20240401T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'حدد خطتك وأهدافك لهذا لمدة ٣ شهور وانطلق!!🏃🏻‍♂️​',
                    start: '20240402T090000Z',
                    end: '20240402T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240405T090000Z',
                    end: '20240405T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​',
                    start: '20240408T090000Z',
                    end: '20240408T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'صباحك صحة،كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240412T090000Z',
                    end: '20240412T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                    start: '20240416T090000Z',
                    end: '20240416T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟 ​2. ‏وحدد وجهتك🎯​3. ‏وانطلق 📢🏃🏻​',
                    start: '20240419T090000Z',
                    end: '20240419T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'وصلت لآخر أسبوع بهذا الشه     لا تنسَ  تتابع تقدمك واستعد للتحديات​',
                    start: '20240421T090000Z',
                    end: '20240421T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'صباحك صحة وإنجاز 🤩❤️​     كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240428T090000Z',
                    end: '20240428T100000Z',
                },


                {
                    title: 'محترف',
                    description: 'شهر جديد وخطوات جديدة 🤩​    هدفك هذا الشهر تحديد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك أو إخوانك، مثل المشي -القفز على الحبل- الدراجات- كرة قدم- لعبة البادل​',
                    start: '20240501T090000Z',
                    end: '20240501T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'تابع تقدمك واستعد للتحديات، كن مرن، لا تخف من تغيير خطتك أو اهدافك عند مواجهة عقبات أو صعوبات ​',
                    start: '20240507T090000Z',
                    end: '20240507T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جمعة مباركة🤍 كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                    start: '20240510T090000Z',
                    end: '20240510T100000Z',
                },
                {
                    title: 'محترف',
                    description: "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                    start: '20240517T090000Z',
                    end: '20240517T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                    start: '20240519T090000Z',
                    end: '20240519T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جرب نشاط جديد مع والديك أو أطفالك وشاركنا على هاشتاق #امش٣٠​',
                    start: '20240525T090000Z',
                    end: '20240525T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                    start: '20240530T090000Z',
                    end: '20240530T100000Z',
                },
               
               

                {
                    title: 'محترف',
                    description: 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️​ وما يحتاج نوصيك اكتب خطتك وأهدافك للسنة القادمة ولا تنسَ اللي حولك وكون قدوة لهم​',
                    start: '20240601T090000Z',
                    end: '20240601T100000Z',
                },
            
                {
                    title: 'محترف',
                    description: 'صباحك صحة،​  كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                    start: '20240617T090000Z',
                    end: '20240617T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'لا تنسَ تمارين الاستطالة والإحماء​',
                    start: '20240624T090000Z',
                    end: '20240624T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'جرب رياضة اخرى اليوم غير المشي ​ اسبح - ارفع اثقال- جرب الدراجة- يوغا​',
                    start: '20240628T090000Z',
                    end: '20240628T100000Z',
                },
                {
                    title: 'محترف',
                    description: 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الآن دورك تكمل وتكون قدوة للي حولك ما يحتاج نوصيك شاركهم متعة المشي واستمر ولا توقف 🏃🏻‍♂️💪🏼​',
                    start: '20240630T090000Z',
                    end: '20240630T100000Z',
                },
            ]
        }

        document.getElementById('button').addEventListener('click', function () {
            let calContent = 'BEGIN:VCALENDAR\nVERSION:2.0\n';

            events.forEach((event, index) => {
                calContent += `BEGIN:VEVENT
DTSTAMP:${new Date().toISOString().replace(/[-:.]/g, '')}
DTSTART:${event.start}
DTEND:${event.end}
SUMMARY:${event.title}
DESCRIPTION:${event.description}
LOCATION:${event.location}
END:VEVENT\n`;
            });

            calContent += 'END:VCALENDAR';

            const dataUrl = 'data:text/calendar;charset=utf-8,' + encodeURIComponent(calContent);
            this.setAttribute('href', dataUrl);
            document.getElementById('button').setAttribute('href', dataUrl);
        });
    }
    else {


        function initClient() {
            gapi.client.init({
                clientId: '831010665054-18pkq0jo07jcl72r3kg1lupei18fc8hl.apps.googleusercontent.com',
                discoveryDocs: ["https://www.googleapis.com/discovery/v1/apis/calendar/v3/rest"],
                scope: 'https://www.googleapis.com/auth/calendar',
                cookiepolicy: 'single_host_origin',
                plugin_name: 'hello'
            });
        }

        gapi.load('client:auth2', initClient);

        function handleAuthClick() {
            gapi.auth2.getAuthInstance().signIn().then((res) => {
                document.getElementById('button').click();

            });
        }


        document.getElementById('button').addEventListener('click', function () {

            const totalValue = localStorage.getItem('totalValue');

            if (totalValue < 2) {
                var events = [
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "شهر جديد وإنجازات جديدة كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله",
                        'start': {
                            'dateTime': '2023-11-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع١٤ دقيقة مشي يومين بالأسبوع لا  تنسَ سخن عضلاتك وهيئ جسمك قبل تمشي',
                        'start': {
                            'dateTime': '2023-11-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'الالتزام بسلوك المشي سهل... لو غيرت البيئة زودت الحركة بتفاصيل يومك مشيت مع  صديق أو عائلتك ',
                        'start': {
                            'dateTime': '2023-11-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "تعرف علامات المشي الصحيح؟ اطلع على الرابط التالي https://www.moh.gov.sa/HealthAwareness/EducationalContent/PublicHealth/Pages/Walking.aspx ",
                        'start': {
                            'dateTime': '2023-11-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "زود يوم  على هدفك  وامش ١٤ دقيقة ٣ ايام بالأسبوع ",
                        'start': {
                            'dateTime': '2023-11-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "قبل تمشي اليوم  تأكد من اختيار الحذاء الصحيح المناسب لك يكون مقاسك سميك من جهة الكعب.  مزود بطبقة لتوسيد القدم. كعب ثابت لتثبيت القدم",
                        'start': {
                            'dateTime': '2023-11-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼 ‏وجمعتك مباركة",
                        'start': {
                            'dateTime': '2023-11-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود  دقيقتين وخلها ١٦',
                        'start': {
                            'dateTime': '2023-11-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "المشي يأخذ  ٢٪ تقريبًا من يومك، وكل اللي تحتاجه  حذاء مناسب لبس مريح وانطلق📢🏃🏻",
                        'start': {
                            'dateTime': '2023-11-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق  وخلها 19",
                        'start': {
                            'dateTime': '2023-11-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },



                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "تحدى نفسك وأصدقائك،  مين عنده اللياقة أعلى ؟ تقدرون تستخدمون تطبيق صحتي لحساب عدد الخطوات ",
                        'start': {
                            'dateTime': '2023-11-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "لا تنسَ تشرب ماء ، قبل تمشي اليوم",
                        'start': {
                            'dateTime': '2023-11-29T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "هدفك في هذا الأسبوع٢٢ دقيقة مشي  ٣ أيام بالأسبوع لا تنسَ تمارين التمدد ",
                        'start': {
                            'dateTime': '2023-12-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كلما زاد نبضك خلال المشي كلما ارتفعت لياقتك ",
                        'start': {
                            'dateTime': '2023-12-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'قيس تطور أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك ',
                        'start': {
                            'dateTime': '2023-12-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ":زود دقيقتين على هدفك وامش ٢٤ دقيقة ",
                        'start': {
                            'dateTime': '2023-12-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "صباحك نشاط وصحة   اختر الحذاء المناسب👟 ‏وحدد وجهتك🎯 ‏وانطلق 📢🏃🏻",
                        'start': {
                            'dateTime': '2023-12-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "صباحك صحة وإنجاز 🤩❤️ كم خطوة مشيت اليوم؟ شاركنا  على #امش30",
                        'start': {
                            'dateTime': '2023-12-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "جاء الوقت ارفع هدفك وزود ٣ دقائق وخلها 27  ",
                        'start': {
                            'dateTime': '2023-12-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك',
                        'start': {
                            'dateTime': '2023-12-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "22:خلنا معك وأنت تمشي 🏃🏻، واسمع  بودكاست #عش_بصحة https://bit.ly/3uGoNwI                            ",
                        'start': {
                            'dateTime': '2023-12-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق  وخلها 30",
                        'start': {
                            'dateTime': '2023-12-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة",
                        'start': {
                            'dateTime': '2023-12-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "مبروووك ... وصلت لـ٣٠ دقيقة 🎉 👏🏻 كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻",
                        'start': {
                            'dateTime': '2023-12-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​٣٠ دقيقة مشي ​لا تنسَ ​تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2024-1-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كيف تستمر وتحافظ على سلوك المشي؟​• غير بيئتك المحيطة، أو كن مؤثرا فيهم .​ • زود الحركة بتفاصيل يومك​ • غير مكان مشيك من فترة لفترة​• امشِ مع أحد تحبه.​",
                        'start': {
                            'dateTime': '2024-1-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك ​وامش ٣٢ دقائق​',
                        'start': {
                            'dateTime': '2024-1-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ":تحس عضلاتك شاده؟ لا تنسَ ​• سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين",
                        'start': {
                            'dateTime': '2024-1-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ":صباحك صحّة ✋، ​‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة",
                        'start': {
                            'dateTime': '2024-1-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "جاء الوقت ارفع هدفك وزود​٣ دقائق وخلها 35 دقيقة",
                        'start': {
                            'dateTime': '2024-1-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ':لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-1-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',

                        'description': "بشر، حققت الهدف هذا الأسبوع ؟🤩​في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​",
                        'start': {
                            'dateTime': '2024-1-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع  بهذا الشهر استمر على ٣٥، ٣ايام بالأسبوع",
                        'start': {
                            'dateTime': '2024-1-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',

                        'location': '',
                        'description': "جرب توقف اليوم بعيد، وكملها مشي للدوام.",
                        'start': {
                            'dateTime': '2024-1-23T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!",
                        'start': {
                            'dateTime': '2024-1-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "وصلنا اسبوع ٢١ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!​هدفك في هذا الأسبوع​ ٣٨ دقيقة مشي ​",
                        'start': {
                            'dateTime': '2024-1-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "3 عناصر تؤثر على أدائك في التمرين:​ -نومك​ -تغذيتك خلال اليوم​ -شربك للماء​",
                        'start': {
                            'dateTime': '2024-2-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "زود دقيقتين على هدفك ​وامش ٤٠ دقائق ​",
                        'start': {
                            'dateTime': '2024-2-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "قوة عضلاتك، تعديل مزاجك، توازن جسمك، ولياقة قلبك، كلها تعتمد على نشاطك البدني​",
                        'start': {
                            'dateTime': '2024-2-6T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-6T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ":اجمع الاثنين!​ اقضِ وقتك مع احبابك ، ومارسوا الرياضة معا.​",
                        'start': {
                            'dateTime': '2024-2-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "استمر على هدفك ​ وامش ٤٠ دقيقةو ٣ أيام بالأسبوع ​",
                        'start': {
                            'dateTime': '2024-2-11T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-11T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',

                        'desription': "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                        'start': {
                            'dateTime': '2024-2-13T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-13T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "صباحك صحة وإنجاز 🤩❤️​حافظ على صحتك واستمر بتحقيق خطواتك! 🤩​",
                        'start': {
                            'dateTime': '2024-2-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٤٢  ",
                        'start': {
                            'dateTime': '2024-2-18T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-18T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​",
                        'start': {
                            'dateTime': '2024-2-20T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-20T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',

                        'location': '',
                        'description': "جمعة مباركة🤍​كم خطوة مشيت اليوم؟ شاركنا  على #امش30​",
                        'start': {
                            'dateTime': '2024-2-23T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',

                        'description': "كفو عليك وصلت لآخر أسبوع​ بهذا الشهر زودها  ٣ دقائق ​وخلها ٤٥​",
                        'start': {
                            'dateTime': '2024-2-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي  ​",
                        'start': {
                            'dateTime': '2024-2-27T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "هدفك في هذا الأسبوع​ الاستمرار على ٤٥ دقيقة مشي ​مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​",
                        'start': {
                            'dateTime': '2024-3-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "صباحك صحة وإنجاز 🤩❤️​المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​",
                        'start': {
                            'dateTime': '2024-3-6T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-6T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                  
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "لا تحتار متى تمشي في​ رمضان ..​بعد التراويح وقت مناسب ​أو قبل السحور",
                        'start': {
                            'dateTime': '2024-3-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "جاء الوقت ارفع هدفك ​دقيقتين وخلها ٤٨    ",
                        'start': {
                            'dateTime': '2024-3-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ":رمضان كريم🤍​خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​",
                        'start': {
                            'dateTime': '2024-3-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "تذكر المشي إلى المسجد صحة وأجر​",
                        'start': {
                            'dateTime': '2024-3-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ":زود ٣ دقائق على هدفك يابطل وامش ٥٠ دقائق ​",
                        'start': {
                            'dateTime': '2024-3-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "لا تنسَ تشرب ماء ، قبل تمشي اليوم .​",
                        'start': {
                            'dateTime': '2024-3-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كملت عدد خطواتك لليوم ؟  يمديك تلحق ​جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​",
                        'start': {
                            'dateTime': '2024-3-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع​ بهذا الشهر زودها  ٣ دقائق ​وخلها ٥٣​",
                        'start': {
                            'dateTime': '2024-3-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "حمل كتاب صوتي أو بودكاست ​وأنطلق 🏃🏻‍♂️​",
                        'start': {
                            'dateTime': '2024-3-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': "مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​​",
                        'start': {
                            'dateTime': '2024-3-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​ ٥٥ دقيقة مشي​  مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​',
                        'start': {
                            'dateTime': '2024-4-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كيف تتعامل مع آلام العضلات​ بعد التمرين؟​ - أكثر من السوائل. مارس بعض تمارين الإطالة الخفيفة.​جرب الكمادات الدافئة أو الثلج لتخفيف الألم.​  جرب الجاكوزي وقم بتدليك مكان الألم.​',
                        'start': {
                            'dateTime': '2024-4-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'استمر على هدفك ​ وامش ٥٥ دقيقة ٣ ايام بالأسبوع ​',
                        'start': {
                            'dateTime': '2024-4-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ':لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​',
                        'start': {
                            'dateTime': '2024-4-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'صباحك صحة،​كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-4-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'زود ٣ دقائق على هدفك يابطل وامش ٥٨ دقائق ​',
                        'start': {
                            'dateTime': '2024-4-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                        'start': {
                            'dateTime': '2024-4-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': ':صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟 ​2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​ ',
                        'start': {
                            'dateTime': '2024-4-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها دقيقتين بس! وخلها ٦٠ د، ​',
                        'start': {
                            'dateTime': '2024-4-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كيف تكوّن صداقات جديدة مع الأشخاص النشيطين بدنيًا؟!​ انضم إلى نوادٍ رياضية، أو مجموعات مهتمة بالمشي في مدينتك عبر مواقع التواصل الاجتماعي.​',
                        'start': {
                            'dateTime': '2024-4-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'مبرووووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​إنجاز يفتخر فيه فلا تنسَ تكافئ نفسك  👏🏻​وبهذه المناسبة بنغير أسلوب تحدي للشهر الجاي​',
                        'start': {
                            'dateTime': '2024-4-27T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'جمعة مباركة🤍​كم خطوة مشيت اليوم؟ شاركنا  على #امش30',
                        'start': {
                            'dateTime': '2024-5-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع   ',
                        'start': {
                            'dateTime': '2024-5-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'احرق سعراتك واطلع امشي​',
                        'start': {
                            'dateTime': '2024-5-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​ المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                        'start': {
                            'dateTime': '2024-5-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع    ',
                        'start': {
                            'dateTime': '2024-5-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'أحرص على ممارسة تمارين  تقوية العضلات 💪 ​على الأقل مرتين في الأسبوع​',
                        'start': {
                            'dateTime': '2024-5-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​',
                        'start': {
                            'dateTime': '2024-5-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'جاء الوقت زودها يوم وخلها  ٣٠~ ٦٠ دقيقة ، ٥ ايام بالأسبوع     ​',
                        'start': {
                            'dateTime': '2024-5-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'إذا كنت مشغول اليوم جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-5-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع​ بهذا الشهر استمر على ٣٠~ ٦٠ دقيقة ، ٥ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-5-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .',
                        'start': {
                            'dateTime': '2024-5-29T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'صباحك نشاط وحركة ​ كل خطوة تمشيها تنعكس على صحتك، لا ينتهي يومك بدون مشي​ ',
                        'start': {
                            'dateTime': '2024-5-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'وصلنا لأخر شهر من التذكيرات ❤️​فخورين فيك حققت انجاز عظيم بـ٩ شهور بس قدرت تبدأ من الصفر حتى ٦٠ دقيقة مشي!!​بهذه المناسبة هدفك هذا الشهر بيكون مختلف،​ أنت تحدده، عندك خيارين: تزيد المدة أو الأيام ​ أو تحافظ على مستواك​مستعد!؟🤩❤️',
                        'start': {
                            'dateTime': '2024-6-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'حدد خطتك وأهدافك لهذا الشهر كامل ​ وانطلق!!🏃🏻‍♂️',
                        'start': {
                            'dateTime': '2024-6-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​ •  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                        'start': {
                            'dateTime': '2024-6-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-6-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'حددت خطتك وطبقتها؟ كل اللي عليك تراقب أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك.​',
                        'start': {
                            'dateTime': '2024-6-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'كيف تستمر على اتباع سلوك المشي؟ ​ -بسط السلوك، قسم المشي على دفعات على مدار اليوم​ - اصنع  بيئة محفزة. ​-اجعل الإشارة واضحة، استخدم تطبيقات تتبّع العادات أو منبه لتذكيرك ​',
                        'start': {
                            'dateTime': '2024-6-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'صباحك صحة، كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-6-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'تابع تقدمك واستعد للتحديات، كن مرن ولا تخف من تعديل أو تغيير خططك وأهدافك عند مواجهة عقبات أو صعوبات ​',
                        'start': {
                            'dateTime': '2024-6-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'خامل',
                        'location': '',
                        'description': 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الكرة بملعبك الآن، صار عندك القدرة والمهارات لممارسة المشي والمحافظة عليه',
                        'start': {
                            'dateTime': '2024-6-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },


                ];
            }
            else if (totalValue >= 2 && totalValue <= 4) {
                var events = [
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':شهر جديد وإنجازات جديدة  كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله​',
                        'start': {
                            'dateTime': '2023-11-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​ ٢٢ دقيقة مشي  ٣ أيام بالأسبوع​  لا تنسَ ​ تمارين التمدد ​',
                        'start': {
                            'dateTime': '2023-11-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'تحدى نفسك وأصدقائك،  مين عنده اللياقة أعلى ؟​ تقدرون تستخدمون تطبيق صحتي لحساب عدد الخطوات​',
                        'start': {
                            'dateTime': '2023-11-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل​ وامش ٢٤ دقائق',
                        'start': {
                            'dateTime': '2023-11-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'الالتزام بسلوك المشي سهل... لو​ • غيرت البيئة​ • زودت الحركة بتفاصيل يومك​ • مشيت مع  صديق أو عائلتك ​',
                        'start': {
                            'dateTime': '2023-11-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​ وجمعتك مباركة​',
                        'start': {
                            'dateTime': '2023-11-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٢٧       ',
                        'start': {
                            'dateTime': '2023-11-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'الجو جميل وكل بخاطرة يمشي​ جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2023-11-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع​ بهذا الشهر زودها  ٣ دقائق ​ وخلها ٣٠​',
                        'start': {
                            'dateTime': '2023-11-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'مبروووك ... وصلت لـ٣٠ دقيقة 🎉 👏🏻 ​كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​',
                        'start': {
                            'dateTime': '2023-11-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​ ٣٠ دقيقة مشي ​ لا تنسَ ​تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2023-12-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'المشي يأخذ  ٢٪ تقريبًا من يومك، وكل اللي تحتاجه ​·      حذاء مناسب​ ·      لبس مريح​ وانطلق📢🏃🏻​',
                        'start': {
                            'dateTime': '2023-12-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'صباحك صحّة ✋، ​‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                        'start': {
                            'dateTime': '2023-12-8T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش ٣٢  دقيقة​',
                        'start': {
                            'dateTime': '2023-12-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'جرب توقف اليوم بعيد، وكملها مشي للدوام.​',
                        'start': {
                            'dateTime': '2023-12-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2023-12-15T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-15T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٣٥         ',
                        'start': {
                            'dateTime': '2023-12-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':كيف تستمر وتحافظ على سلوك المشي؟​ • غير بيئتك المحيطة، أو كن مؤثرا فيهم .• زود الحركة بتفاصيل يومك​ • غير مكان مشيك من فترة لفترة​ • امشِ مع أحد تحبه.​',
                        'start': {
                            'dateTime': '2023-12-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "بشر، حققت الهدف هذا الأسبوع ؟🤩​في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​",
                        'start': {
                            'dateTime': '2023-12-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر  ٣٨دقيقة في ٣ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2023-12-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                        'start': {
                            'dateTime': '2023-12-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!',
                        'start': {
                            'dateTime': '2023-12-29T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​٤٠ دقيقة مشي ​لا تنسَ ​ تمارين الاستطالة والإحماء​​',
                        'start': {
                            'dateTime': '2023-12-31T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': '3 عناصر تؤثر على أدائك في التمرين:​ -نومك​ -تغذيتك خلال اليوم​ -شربك للماء​',
                        'start': {
                            'dateTime': '2024-1-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':زود دقيقتين على هدفك يابطل وامش ٤٢ دقائق ',
                        'start': {
                            'dateTime': '2024-1-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'جمعة مباركة🤍​كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2024-1-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٤٥ د​ ٣ أيام بالأسبوع ',
                        'start': {
                            'dateTime': '2024-1-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':لا تنسَ تشرب ماء ، قبل تمشي اليوم ',
                        'start': {
                            'dateTime': '2024-1-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':جرّب تروح اليوم مع عائلتك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2024-1-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​ وامش ٤٥ دقائق​',
                        'start': {
                            'dateTime': '2024-1-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'خذ لك بريك ١٠ دقائق من تمارين التمدد',
                        'start': {
                            'dateTime': '2024-1-23T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                        'start': {
                            'dateTime': '2024-1-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٤٨​                            ',
                        'start': {
                            'dateTime': '2024-1-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​ حافظ على صحتك واستمر بتحقيق خطواتك! 🤩​',
                        'start': {
                            'dateTime': '2024-2-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!​ هدفك في هذا الأسبوع​ ٥٠ دقيقة مشي ٣  ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-2-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'صباحك نشاط وصحة ​1. اختر الحذاء المناسب👟 ​ 2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​',
                        'start': {
                            'dateTime': '2024-2-6T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-6T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'اجمع الاثنين!​ اقضِ وقتك مع احبابك ، ومارسوا الرياضة معا.​',
                        'start': {
                            'dateTime': '2024-2-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٢      ',
                        'start': {
                            'dateTime': '2024-2-11T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-11T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'استمر على هدفك يابطل وامش ٥٢ دقائق ٣ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-2-18T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-18T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​                            ',
                        'start': {
                            'dateTime': '2024-2-20T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-20T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'تحدى نفسك اليوم! ​جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                        'start': {
                            'dateTime': '2024-2-23T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                        'start': {
                            'dateTime': '2024-2-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي ',
                        'start': {
                            'dateTime': '2024-2-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​ الاستمرار على ٥٥ دقيقة مشي ​ مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​',
                        'start': {
                            'dateTime': '2024-3-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك ​ دقيقتين وخلها ٥٧',
                        'start': {
                            'dateTime': '2024-3-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ':رمضان كريم🤍​خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                        'start': {
                            'dateTime': '2024-3-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'تذكر المشي إلى المسجد صحة وأجر​',
                        'start': {
                            'dateTime': '2024-3-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'زود ٣ دقائق على هدفك يابطل وامش ٦٠ دقائق ​',
                        'start': {
                            'dateTime': '2024-3-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-3-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​ جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-3-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د، ٣ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                        'start': {
                            'dateTime': '2024-3-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'مبرووووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​ إنجاز يفتخر فيه فلا تنسَ تكافئ نفسك  👏🏻​وبهذه المناسبة بنغير أسلوب تحدي للشهر الجاي​',
                        'start': {
                            'dateTime': '2024-3-31T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "قطعنا مشوار طويل وممتع مع بعض ووصلنا للأسبوع رقم ٣٤ من تحقيق الخطوات والإنجازا🎖️❤️​لذلك الشهر هذا بنرفع الحماس وعدد الأيام ​  مستعد؟! 🤩​",
                        'start': {
                            'dateTime': '2024-4-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "هدفك في هذا الأسبوع​ مشي مابين ٣٠ إلى ٦٠ دقيقة باليوم،  ٤ ايام بالاسبوع​",
                        'start': {
                            'dateTime': '2024-4-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "كيف تتعامل مع آلام العضلات​ بعد التمرين؟​ - أكثر من السوائل.​ - مارس بعض تمارين الإطالة الخفيفة.​ - جرب الكمادات الدافئة أو الثلج لتخفيف الألم.​- جرب الجاكوزي وقم بتدليك مكان الألم.​",
                        'start': {
                            'dateTime': '2024-4-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع     ",
                        'start': {
                            'dateTime': '2024-4-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': ":لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​",
                        'start': {
                            'dateTime': '2024-4-8T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "صباحك صحة،​ كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​",
                        'start': {
                            'dateTime': '2024-4-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "كمل على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع  ",
                        'start': {
                            'dateTime': '2024-4-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                        'start': {
                            'dateTime': '2024-4-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟  2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​210:استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع",
                        'start': {
                            'dateTime': '2024-4-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع     ​",
                        'start': {
                            'dateTime': '2024-4-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع​  بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع​",
                        'start': {
                            'dateTime': '2024-4-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "جمعة مباركة🤍​       كم خطوة مشيت اليوم؟ شاركنا  على #امش30​",
                        'start': {
                            'dateTime': '2024-5-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "هدفك في هذا الأسبوع​  مشي مابين ٣٠ إلى ٧٠ دقيقة باليوم،  ٥ ايام بالاسبوع​",
                        'start': {
                            'dateTime': '2024-5-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                        'start': {
                            'dateTime': '2024-5-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': "كمل على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع     ​",
                        'start': {
                            'dateTime': '2024-5-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': '​صباحك نشاط وحركة   ‏كل خطوة تمشيها تنعكس على صحتك، لا ينتهي يومك بدون مشي​',
                        'start': {
                            'dateTime': '2024-5-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-5-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'إذا كنت مشغول اليوم جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-5-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'خلنا معك وأنت تمشي 🏃🏻، ​  واسمع  بودكاست #عش_بصحة 🎧​ https://bit.ly/3uGoNwI​',
                        'start': {
                            'dateTime': '2024-5-23T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع​   بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-5-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️ فخورين فيك حققت انجاز عظيم بـ١٠ شهور بس قدرت تبدأ من الصفر حتى ٦٠ دقيقة مشي!!​ بهذه المناسبة هدفك هذا الشهر بيكون مختلف،أنت تحدده، عندك خيارين: تزيد المدة أو الأيام  أو تحافظ على مستواك​  مستعد!؟🤩❤️​',
                        'start': {
                            'dateTime': '2024-6-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'حدد خطتك وأهدافك لهذا الشهر كامل ​وانطلق!!🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-6-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​•  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                        'start': {
                            'dateTime': '2024-6-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-6-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'حددت خطتك وطبقتها؟ كل اللي عليك تراقب أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك.​',
                        'start': {
                            'dateTime': '2024-6-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'كيف تستمر على اتباع سلوك المشي؟ ​  -بسط السلوك، قسم المشي على دفعات على مدار اليوم​  - اصنع  بيئة محفزة. ​ -اجعل الإشارة واضحة، استخدم تطبيقات تتبّع العادات أو منبه لتذكيرك ​',
                        'start': {
                            'dateTime': '2024-6-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'صباحك صحة،​ كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-6-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'تابع تقدمك واستعد للتحديات، كن مرن ولا تخف من تعديل أو تغيير خططك وأهدافك عند مواجهة عقبات أو صعوبات ​',
                        'start': {
                            'dateTime': '2024-6-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'ناوي',
                        'location': '',
                        'description': 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الكرة بملعبك الآن، صار عندك القدرة والمهارات لممارسة المشي والمحافظة عليه​ استمر ولا توقف 🏃🏻‍♂️💪🏼​',
                        'start': {
                            'dateTime': '2024-6-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },


                ];
            }
            else if (totalValue >= 6 && totalValue <= 12) {
                var events = [
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'شهر جديد وإنجازات جديدة  كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله​',
                        'start': {
                            'dateTime': '2023-11-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​٢٢ دقيقة مشي  ٣ أيام بالأسبوع​ لا تنسَ ​ تمارين التمدد ',
                        'start': {
                            'dateTime': '2023-11-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'قيس تطور أدائك، تابع  نبضات قلبك، مدة تمرينك و مدى لياقتك.​       ​',
                        'start': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'تحدى نفسك وأصدقائك،  مين عنده اللياقة أعلى ؟​  تقدرون تستخدمون تطبيق صحتي لحساب عدد الخطوات​',
                        'start': {
                            'dateTime': '2023-11-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل  وامش ٢٤ دقائق ​',
                        'start': {
                            'dateTime': '2023-11-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​ ‏وجمعتك مباركة​',
                        'start': {
                            'dateTime': '2023-11-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​    ٣ دقائق وخلها ٢٧       ​',
                        'start': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'الجو جميل وكل بخاطرة يمشي جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2023-11-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع​  بهذا الشهر زودها  ٣ دقائق ​   وخلها ٣٠​',
                        'start': {
                            'dateTime': '2023-11-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'مبروووك ... وصلت لـ٣٠ دقيقة 🎉 👏🏻 ​ كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​',
                        'start': {
                            'dateTime': '2023-11-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​33 دقيقة مشي ​لا تنسَ ​ تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2023-12-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'صباحك صحّة ✋، ​ ‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                        'start': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش 35 دقيقة​',
                        'start': {
                            'dateTime': '2023-12-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جرب توقف اليوم بعيد، وكملها مشي للدوام.​',
                        'start': {
                            'dateTime': '2023-12-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2023-12-15T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-15T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'ارفع هدفك يا بطل وامش  ٣٨دقيقة  ٣ ايام بالأسبوع                ​',
                        'start': {
                            'dateTime': '2023-12-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'بشر، حققت الهدف هذا الأسبوع ؟   في حال ما قدرت توصل لهدفك، عادي كمل على الجدول ، و أضف له أسبوع.​ ​',
                        'start': {
                            'dateTime': '2023-12-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر  زودها دقيقتين وخلها  ٤٠د ​',
                        'start': {
                            'dateTime': '2023-12-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'تحس عضلاتك شاده؟ لا تنسَ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                        'start': {
                            'dateTime': '2023-12-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!​',
                        'start': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​٤٢ دقيقة مشي ​لا تنسَ ​تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2023-12-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': ' 3 عناصر تؤثر على أدائك في التمرين:​-نومك​ -تغذيتك خلال اليوم​ -شربك للماء​',
                        'start': {
                            'dateTime': '2024-1-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش ٤٤ دقيقة ​',
                        'start': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جمعة مباركة🤍​ كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2024-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٤٧ دقيقة​',
                        'start': {
                            'dateTime': '2024-1-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-1-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2024-1-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​ وامش ٤٧ دقيقة، ٣ ايام بالأسبوع ​',
                        'start': {
                            'dateTime': '2024-1-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                        'start': {
                            'dateTime': '2024-1-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٠دقيقة​',
                        'start': {
                            'dateTime': '2024-1-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!هدفك في هذا الأسبوع ٥٠ دقيقة مشي ٣  ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-2-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'صباحك نشاط وصحة ​1. اختر الحذاء المناسب👟 ​2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​',
                        'start': {
                            'dateTime': '2024-2-6T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-6T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'اجمع الاثنين!​   اقضِ وقتك مع أطفالك ، ومارسوا الرياضة معا.​',
                        'start': {
                            'dateTime': '2024-2-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٢                 ​',
                        'start': {
                            'dateTime': '2024-2-11T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-11T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​    المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​',
                        'start': {
                            'dateTime': '2024-2-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​  وامش ٥٢ دقائق ٣ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-2-18T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-18T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-2-20T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-20T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'تحدى نفسك اليوم! ​   جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                        'start': {
                            'dateTime': '2024-2-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                        'start': {
                            'dateTime': '2024-2-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​ الاستمرار على ٥٥ دقيقة مشي  مايحتاج نوصيك بتسخين عضلاتك وتهيئ جسمك قبل  تمشي​',
                        'start': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك ​دقيقتين وخلها 57 دقيقة.            ​',
                        'start': {
                            'dateTime': '2024-3-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'رمضان كريم🤍​ خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                        'start': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'تذكر المشي إلى المسجد صحة وأجر​',
                        'start': {
                            'dateTime': '2024-3-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'زود ٣ دقائق على هدفك يابطل وامش ٦٠ دقيقة ​',
                        'start': {
                            'dateTime': '2024-3-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​  جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-3-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د، ٣ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                        'start': {
                            'dateTime': '2024-3-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'مبرووووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​       إنجاز يفتخر فيه فلا تنسَ تكافئ نفسك  👏🏻​ وبهذه المناسبة بنغير أسلوب تحدي للشهر الجاي​',
                        'start': {
                            'dateTime': '2024-3-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'قطعنا مشوار طويل وممتع مع بعض ووصلنا للأسبوع رقم ٣٤ من تحقيق الخطوات والأهداف  🎖️❤️​ لذلك الشهر هذا بنرفع الحماس وعدد الأيام ​ مستعد؟! 🤩​',
                        'start': {
                            'dateTime': '2024-4-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "هدفك في هذا الأسبوع​ مشي مابين ٣٠ إلى ٦٠ دقيقة باليوم،  ٤ ايام بالاسبوع​",
                        'start': {
                            'dateTime': '2024-4-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': ":لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​",
                        'start': {
                            'dateTime': '2024-4-8T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "كمل على ٣٠~ ٦٠ دقيقة ، ٤ ايام بالأسبوع     ",
                        'start': {
                            'dateTime': '2024-4-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'صباحك صحة، كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-4-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': '',
                        'description': "كمل على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع  ",
                        'start': {
                            'dateTime': '2024-4-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "خذ لك بريك ١٠ دقائق من تمارين التمدد​",
                        'start': {
                            'dateTime': '2024-4-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟  2. ‏وحدد وجهتك🎯​ 3. ‏وانطلق 📢🏃🏻​210:استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع",
                        'start': {
                            'dateTime': '2024-4-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع     ​",
                        'start': {
                            'dateTime': '2024-4-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'أحرص على ممارسة تمارين  تقوية العضلات 💪 ​على الأقل مرتين في الأسبوع​',
                        'start': {
                            'dateTime': '2024-4-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع​  بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٤ ايام بالأسبوع​",
                        'start': {
                            'dateTime': '2024-4-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "جمعة مباركة🤍​       كم خطوة مشيت اليوم؟ شاركنا  على #امش30​",
                        'start': {
                            'dateTime': '2024-5-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "هدفك في هذا الأسبوع​  مشي مابين ٣٠ إلى ٧٠ دقيقة باليوم،  ٥ ايام بالاسبوع​",
                        'start': {
                            'dateTime': '2024-5-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                        'start': {
                            'dateTime': '2024-5-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': "كمل على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع     ​",
                        'start': {
                            'dateTime': '2024-5-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'غير مكان مشيك المعتاد اطلع لحديقة أو سوق أو امش في البيت ​',
                        'start': {
                            'dateTime': '2024-5-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'صباحك نشاط وحركة ​ كل خطوة تمشيها تنعكس على صحتك، لا ينتهي يومك بدون مشي​ ',
                        'start': {
                            'dateTime': '2024-5-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-5-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'إذا كنت مشغول اليوم جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-5-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع​   بهذا الشهر استمر على ٣٠~ ٧٠ دقيقة ، ٥ ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-5-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-5-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️ فخورين فيك حققت انجاز عظيم بـ١٠ شهور بس قدرت تبدأ من الصفر حتى ٦٠ دقيقة مشي!!​ بهذه المناسبة هدفك هذا الشهر بيكون مختلف،أنت تحدده، عندك خيارين: تزيد المدة أو الأيام  أو تحافظ على مستواك​  مستعد!؟🤩❤️​',
                        'start': {
                            'dateTime': '2024-6-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'حدد خطتك وأهدافك لهذا الشهر كامل ​وانطلق!!🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-6-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​•  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                        'start': {
                            'dateTime': '2024-6-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-6-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'حددت خطتك وطبقتها؟ كل اللي عليك تراقب أدائك، تابع نبضات قلبك، مدة تمرينك و مدى لياقتك.​',
                        'start': {
                            'dateTime': '2024-6-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'صباحك صحة،​ كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-6-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'تابع تقدمك واستعد للتحديات، كن مرن ولا تخف من تعديل أو تغيير خططك وأهدافك عند مواجهة عقبات أو صعوبات ​',
                        'start': {
                            'dateTime': '2024-6-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'بادي',
                        'location': '',
                        'description': 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الكرة بملعبك الآن، صار عندك القدرة والمهارات لممارسة المشي والمحافظة عليه',
                        'start': {
                            'dateTime': '2024-6-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                ];
            }

            else if (totalValue >= 18 && totalValue <= 26) {
                var events = [
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': ':شهر جديد وإنجازات جديدة  كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله​',
                        'start': {
                            'dateTime': '2023-11-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​٣٦ دقيقة مشي ​لا تنسَ ​ تمارين التمدد ​',
                        'start': {
                            'dateTime': '2023-11-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'قيس تطور أدائك، تابع  نبضات قلبك، مدة تمرينك و مدى لياقتك.​       ​',
                        'start': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش ٣٨ دقائق ​',
                        'start': {
                            'dateTime': '2023-11-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼​      ‏وجمعتك مباركة',
                        'start': {
                            'dateTime': '2023-11-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​    ٣ دقائق وخلها ٢٧       ​',
                        'start': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'الجو جميل وكل بخاطرة يمشي​ جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2023-11-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق  وخلها 43",
                        'start': {
                            'dateTime': '2023-11-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2023-11-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': "شهر جديد وإنجازات جديدة كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله",
                        'start': {
                            'dateTime': '2023-12-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​    ٤٥ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2023-12-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': ':قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2023-12-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك صحّة ✋، ​ ‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                        'start': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'استمر على ٤٥ دقيقة ​',
                        'start': {
                            'dateTime': '2023-12-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': '‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​',
                        'start': {
                            'dateTime': '2023-12-15T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-15T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها ٣٥         ',
                        'start': {
                            'dateTime': '2023-12-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': ':كيف تستمر وتحافظ على سلوك المشي؟​ • غير بيئتك المحيطة، أو كن مؤثرا فيهم .• زود الحركة بتفاصيل يومك​ • غير مكان مشيك من فترة لفترة​ • امشِ مع أحد تحبه.​',
                        'start': {
                            'dateTime': '2023-12-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': "بشر، حققت الهدف هذا الأسبوع ؟🤩​في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​",
                        'start': {
                            'dateTime': '2023-12-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر  ٣٨دقيقة في ٣ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2023-12-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                        'start': {
                            'dateTime': '2023-12-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!​',
                        'start': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​    ٥٠ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2024-1-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                        'start': {
                            'dateTime': '2024-1-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش 52 دقيقة ​',
                        'start': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'سمعت حلقة بودكاست الجديدة من (عش بصحة )؟​ لا تفوتك ، حملها واسمعها، وأنت تمشي​',
                        'start': {
                            'dateTime': '2024-1-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جمعة مباركة🤍​ كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2023-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​ وامش 52 دقائق​',
                        'start': {
                            'dateTime': '2024-1-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-1-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جرّب تروح اليوم مع أطفال عائلتك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2024-1-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​  وامش ٥٢ د ٣ ايام بالأسبوع ​',
                        'start': {
                            'dateTime': '2024-1-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                        'start': {
                            'dateTime': '2024-1-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                        'start': {
                            'dateTime': '2024-1-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​ حافظ على صحتك واستمر بتحقيق خطواتك! 🤩​',
                        'start': {
                            'dateTime': '2024-2-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!​ هدفك في هذا الأسبوع​ ٥٠ دقيقة مشي ٣  ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-2-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },



                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'اجمع الاثنين!​ اقضِ وقتك مع احبابك ، ومارسوا الرياضة معا.​',
                        'start': {
                            'dateTime': '2024-2-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'استمر على هدفك يابطل وامش ٥٥ دقائق ٣ ايام بالأسبوع              ​',
                        'start': {
                            'dateTime': '2024-2-11T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-11T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​    المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​',
                        'start': {
                            'dateTime': '2024-2-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': '​ جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٧   ​',
                        'start': {
                            'dateTime': '2024-2-18T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-18T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'مبروووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​  كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​',
                        'start': {
                            'dateTime': '2024-2-29T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'هدفك في هذا الشهر   الاستمرار على ٦٠ دقيقة مشي لكن ٤ أيام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'America/Los_Angeles'
                        },
                        'end': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'استمر على ٦٠ دقيقة مشي ٤ أيام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'رمضان كريم🤍​ خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                        'start': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'حمل كتاب صوتي أو بودكاست وأنطلق 🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-3-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-3-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​  جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-3-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د ٤ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'تذكر المشي إلى المسجد صحة وأجر​',
                        'start': {
                            'dateTime': '2024-3-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                        'start': {
                            'dateTime': '2024-3-29T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'وصلنا للأسبوع رقم ٣٠ من تحقيق الإنجازات والأهداف 🎖️❤️بهذه المناسبة هدفنا هذه ٣ شهور بيكون غير،​أنت اللي تحدده، بيكون عندك خيارين يا تزيد المدة أو يوم أو المحافظة على مستواك.​مستعد!؟🤩​',
                        'start': {
                            'dateTime': '2024-4-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'حدد خطتك وأهدافك لهذا لمدة ٣ شهور وانطلق!!🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-4-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': '•حدد هدفك​ • اصنع خطة ​• ابدأ بشيء بسيط وتدرج​•  أزل المعوقات ​• جهز بيئتك ​• تابع تقدمك واستعد للتحديات​ • احتفل بالنجاحات ​',
                        'start': {
                            'dateTime': '2023-4-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-4-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-4-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​',
                        'start': {
                            'dateTime': '2024-4-8T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك صحة،كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-4-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                        'start': {
                            'dateTime': '2024-4-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟 ​2. ‏وحدد وجهتك🎯​3. ‏وانطلق 📢🏃🏻​',
                        'start': {
                            'dateTime': '2024-4-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'وصلت لآخر أسبوع بهذا الشه     لا تنسَ  تتابع تقدمك واستعد للتحديات​',
                        'start': {
                            'dateTime': '2024-4-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​    كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2024-4-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'شهر جديد وخطوات جديدة 🤩​    هدفك هذا الشهر تحديد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك أو إخوانك، مثل المشي -القفز على الحبل- الدراجات- كرة قدم- لعبة البادل​',
                        'start': {
                            'dateTime': '2024-5-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'تابع تقدمك واستعد للتحديات، كن مرن، لا تخف من تغيير خطتك أو اهدافك عند مواجهة عقبات أو صعوبات ​',
                        'start': {
                            'dateTime': '2024-5-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جمعة مباركة🤍 كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2024-5-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'غير مكان مشيك المعتاد اطلع لحديقة أو سوق أو امش في البيت ​',
                        'start': {
                            'dateTime': '2024-5-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                        'start': {
                            'dateTime': '2023-5-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-5-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-5-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جرب نشاط جديد مع والديك أو أطفالك وشاركنا على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-5-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-5-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️​ وما يحتاج نوصيك اكتب خطتك وأهدافك للسنة القادمة ولا تنسَ اللي حولك وكون قدوة لهم​',
                        'start': {
                            'dateTime': '2024-6-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'أحرص على ممارسة تمارين  تقوية العضلات 💪 ​ على الأقل مرتين في الأسبوع​',
                        'start': {
                            'dateTime': '2024-6-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'كيف تتعامل مع آلام العضلات​ بعد التمرين؟​ - أكثر من السوائل.​ - مارس بعض تمارين الإطالة الخفيفة.​ - جرب الكمادات الدافئة أو الثلج لتخفيف الألم.​ - جرب الجاكوزي وقم بتدليك مكان الألم.​',
                        'start': {
                            'dateTime': '2024-6-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'صباحك صحة،​  كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-6-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'لا تنسَ تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2024-6-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'جرب رياضة اخرى اليوم غير المشي ​ اسبح - ارفع اثقال- جرب الدراجة- يوغا​',
                        'start': {
                            'dateTime': '2024-6-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                    {
                        'summary': 'منطلق',
                        'location': '',
                        'description': 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الآن دورك تكمل وتكون قدوة للي حولك ما يحتاج نوصيك شاركهم متعة المشي واستمر ولا توقف 🏃🏻‍♂️💪🏼​',
                        'start': {
                            'dateTime': '2024-6-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                ];
            }
            else if (totalValue >= 30 && totalValue <= 50) {
                var events = [
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': ' شهر جديد وتحديات جديد  جرب تحدى نفسك وأصدقائك، مين عنده اللياقة أعلى ؟ تقدر تستخدم تطبيق صحتي لحساب عدد الخطوات​',
                        'start': {
                            'dateTime': '2023-11-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​     ٣٦ دقيقة مشي ​ لا تنسَ   تمارين التمدد ​',
                        'start': {
                            'dateTime': '2023-11-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'قيس تطور أدائك، تابع  نبضات قلبك، مدة تمرينك و مدى لياقتك.​       ​',
                        'start': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش ٣٨ دقائق ​',
                        'start': {
                            'dateTime': '2023-11-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'اليوم غيّر خطتك وتوجه للمسجد مشي .. صحة وأجر💪🏼‏وجمعتك مباركة',
                        'start': {
                            'dateTime': '2023-11-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​    ٣ دقائق وخلها 40       ​',
                        'start': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'الجو جميل وكل بخاطرة يمشي​ جرّب تروح اليوم مع أطفالك أو أخوانك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2023-11-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': "كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق  وخلها 43",
                        'start': {
                            'dateTime': '2023-11-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2023-11-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-11-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': "شهر جديد وإنجازات جديدة كيف كان الشهر اللي فات سهل صح؟ هذا الشهر بيكون اسهل ان شاء الله",
                        'start': {
                            'dateTime': '2023-12-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​    ٤٥ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2023-12-3T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': ':قسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2023-12-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'صباحك صحّة ✋، ​ ‏جرب تشارك أهلك متعة المشي لمدة نصف ساعة ​',
                        'start': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'استمر على ٤٥ دقيقة ​',
                        'start': {
                            'dateTime': '2023-12-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'بشر، حققت الهدف هذا الأسبوع ؟🤩​  في حال ما قدرت توصل لهدفك، عادي كمل على جدول ، و أضف له أسبوع.​',
                        'start': {
                            'dateTime': '2023-12-15T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-15T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جاء الوقت ارفع هدفك وزود​ ٣ دقائق وخلها 47         ',
                        'start': {
                            'dateTime': '2023-12-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': '‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​',
                        'start': {
                            'dateTime': '2023-12-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر اسبوع بهذا الشهر زودها ٣ دقائق بس! وخلها ٥٠​',
                        'start': {
                            'dateTime': '2023-12-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'تحس عضلاتك شاده؟ لا تنسَ ​ • سخن جسمك قبل التمرين​ • مدد عضلاتك بعد التمرين​',
                        'start': {
                            'dateTime': '2023-12-26T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-26T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'اشحن طاقتك وامشي مع أصدقائك وتحدى عائلتك!​',
                        'start': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-12-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'هدفك في هذا الأسبوع​    ٥٠ دقيقة مشي لا تنسَ  تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2024-1-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'حدد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك ،أو إخوانك، مثل ​المشي -القفز  على الحبل- الدراجات- كرة قدم​',
                        'start': {
                            'dateTime': '2024-1-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'زود دقيقتين على هدفك يابطل وامش 52 دقيقة ​',
                        'start': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جمعة مباركة🤍​ كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2023-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-1-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​ وامش 52 دقائق​',
                        'start': {
                            'dateTime': '2024-1-14T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-1-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جرّب تروح اليوم مع أطفال عائلتك إلى الحديقة ​',
                        'start': {
                            'dateTime': '2024-1-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'استمر على هدفك يابطل​  وامش ٥٢ د ٣ ايام بالأسبوع ​',
                        'start': {
                            'dateTime': '2024-1-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر زودها  ٣ دقائق وخلها ٥٥​',
                        'start': {
                            'dateTime': '2024-1-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                        'start': {
                            'dateTime': '2024-1-31T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-1-31T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'قوة عضلاتك، تعديل مزاجك، توازن جسمك، ولياقة قلبك، كلها تعتمد على نشاطك البدني​',
                        'start': {
                            'dateTime': '2024-2-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'وصلنا اسبوع ٢٢ من التزامك وحرصك على تحقيق أهدافك فخورين فيك!​ هدفك في هذا الأسبوع​ 55 دقيقة مشي ٣  ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-2-4T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-4T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'اجمع الاثنين!​ اقضِ وقتك مع احبابك ، ومارسوا الرياضة معا.​',
                        'start': {
                            'dateTime': '2024-2-9T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-9T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'استمر على هدفك يابطل وامش ٥٥ دقائق ٣ ايام بالأسبوع              ​',
                        'start': {
                            'dateTime': '2024-2-11T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-11T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​    المشي يساعد على التفكير.. جّرب تمشي قبل تنجز مهامك ​',
                        'start': {
                            'dateTime': '2024-2-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-14T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': '​ جاء الوقت ارفع هدفك وزود دقيقتين وخلها ٥٧   ​',
                        'start': {
                            'dateTime': '2024-2-18T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-18T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'افتح عداد الخطوات تطبيق صحتي وانطلق !!🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-2-20T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-20T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'تحدى نفسك اليوم! ​ جرب أي نشاط بدني جديد، مثل لعبة بادل أو الكوره - دراجة - نط الحبل​',
                        'start': {
                            'dateTime': '2024-2-23T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-23T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذه الشهر زودها  ٣ دقائق وخلها ٦٠​',
                        'start': {
                            'dateTime': '2024-2-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'مبروووك ... وصلت لـ٦٠ دقيقة 🎉 👏🏻 ​  كفو والله، لا تنسَ تكافئ نفسك بعد الخطوات اللي مشيتها 👏🏻​',
                        'start': {
                            'dateTime': '2024-2-29T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-2-29T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'هدفك في هذا الشهر   الاستمرار على ٦٠ دقيقة مشي لكن ٤ أيام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'America/Los_Angeles'
                        },
                        'end': {
                            'dateTime': '2024-3-3T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'حمل كتاب صوتي أو بودكاست وأنطلق 🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-3-6T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-6T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'استمر على ٦٠ دقيقة مشي ٤ أيام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'رمضان كريم🤍​ خل رمضان هذا غير  وتحدى أصدقائك أو عائلتك مين أكثر واحد عدد خطوات خلال شهر رمضان​',
                        'start': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'كملت عدد خطواتك لليوم ؟  يمديك تلحق ​ جرب تقسم مشيك على دفعات مثلًا ١٠ دقائق على مدار اليوم حتى توصل لهدفك​',
                        'start': {
                            'dateTime': '2024-3-15T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-15T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-3-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'مّدد خطواتك وعزز صحتك ومزاجك واطلع امشي وشارك أحد أصدقائك متعة المشي  ​',
                        'start': {
                            'dateTime': '2024-3-22T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-22T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'كفو عليك وصلت لآخر أسبوع بهذا الشهر استمر على ٦٠ د ٤ايام بالأسبوع​',
                        'start': {
                            'dateTime': '2024-3-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'تذكر المشي إلى المسجد صحة وأجر​',
                        'start': {
                            'dateTime': '2024-3-27T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-3-27T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'وصلنا للأسبوع رقم ٣٠ من تحقيق الإنجازات والأهداف 🎖️❤️بهذه المناسبة هدفنا هذه ٣ شهور بيكون غير،​أنت اللي تحدده، بيكون عندك خيارين يا تزيد المدة أو يوم أو المحافظة على مستواك.​مستعد!؟🤩​',
                        'start': {
                            'dateTime': '2024-4-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'حدد خطتك وأهدافك لهذا لمدة ٣ شهور وانطلق!!🏃🏻‍♂️​',
                        'start': {
                            'dateTime': '2024-4-2T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-2T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-4-5T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-5T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'لو كنت مستثقل أو مشغول عن المشي اليوم، ابدا بكره من بدري أو جرب طريقة تقسيم المشي على مدار اليوم​',
                        'start': {
                            'dateTime': '2024-4-8T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-8T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },


                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'صباحك صحة،كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-4-12T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-12T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'خذ لك بريك ١٠ دقائق من تمارين التمدد​',
                        'start': {
                            'dateTime': '2024-4-16T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-16T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'صباحك نشاط وصحة ​1. اختر الحذاء الداعم 👟 ​2. ‏وحدد وجهتك🎯​3. ‏وانطلق 📢🏃🏻​',
                        'start': {
                            'dateTime': '2024-4-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'وصلت لآخر أسبوع بهذا الشه     لا تنسَ  تتابع تقدمك واستعد للتحديات​',
                        'start': {
                            'dateTime': '2024-4-21T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-21T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'صباحك صحة وإنجاز 🤩❤️​     كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2024-4-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-4-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'شهر جديد وخطوات جديدة 🤩​    هدفك هذا الشهر تحديد يوم في الأسبوع تمارس فيه الرياضة مع أطفالك أو إخوانك، مثل المشي -القفز على الحبل- الدراجات- كرة قدم- لعبة البادل​',
                        'start': {
                            'dateTime': '2024-5-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'تابع تقدمك واستعد للتحديات، كن مرن، لا تخف من تغيير خطتك أو اهدافك عند مواجهة عقبات أو صعوبات ​',
                        'start': {
                            'dateTime': '2024-5-7T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-7T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جمعة مباركة🤍 كم خطوة مشيت اليوم؟ شاركنا  على #امش30​',
                        'start': {
                            'dateTime': '2024-5-10T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-10T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': "‏ لصحة الجسد، وصحة العلاقات: شارك عائلتك اليوم متعة المشي في أقرب حديقة  أو ممشى 👨‍👩‍👧‍👦​",
                        'start': {
                            'dateTime': '2023-5-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2023-5-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'شاركنا هدفك لهذا الأسبوع على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-5-19T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-19T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جرب نشاط جديد مع والديك أو أطفالك وشاركنا على هاشتاق #امش٣٠​',
                        'start': {
                            'dateTime': '2024-5-25T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-25T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'لا تنسَ تشرب ماء ، قبل تمشي اليوم .​',
                        'start': {
                            'dateTime': '2024-5-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-5-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'وصلنا لأخر شهر من التذكيرات بنشتاق لك😢❤️​ وما يحتاج نوصيك اكتب خطتك وأهدافك للسنة القادمة ولا تنسَ اللي حولك وكون قدوة لهم​',
                        'start': {
                            'dateTime': '2024-6-1T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-1T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'صباحك صحة،​  كمل احتفالات العيد مع  أحبابك وشاركهم متعة المشي في أقرب ممشى لكم​',
                        'start': {
                            'dateTime': '2024-6-17T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-17T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'لا تنسَ تمارين الاستطالة والإحماء​',
                        'start': {
                            'dateTime': '2024-6-24T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-24T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'جرب رياضة اخرى اليوم غير المشي ​ اسبح - ارفع اثقال- جرب الدراجة- يوغا​',
                        'start': {
                            'dateTime': '2024-6-28T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-28T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },
                    {
                        'summary': 'محترف',
                        'location': '',
                        'description': 'وصلنا لنهاية مشوارنا معاك لكن مشوارك مع المشي ما إنتهى. الآن دورك تكمل وتكون قدوة للي حولك ما يحتاج نوصيك شاركهم متعة المشي واستمر ولا توقف 🏃🏻‍♂️💪🏼​',
                        'start': {
                            'dateTime': '2024-6-30T09:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },
                        'end': {
                            'dateTime': '2024-6-30T11:00:00',
                            'timeZone': 'Asia/Riyadh'
                        },

                        'reminders': {
                            'useDefault': false,
                            'overrides': [
                                { 'method': 'email', 'minutes': 24 * 60 },
                                { 'method': 'popup', 'minutes': 10 }
                            ]
                        }
                    },

                ];
            }

            events.forEach(function (event) {
                gapi.client.calendar.events.insert({
                    'calendarId': 'primary',
                    'resource': event
                }).then(function (response) {
                    console.log('Event created: ' + response.result.htmlLink);
                }).catch((err) => {
                    if (err.status === 401) {
                        handleAuthClick();
                    }
                });
            });
            event.preventDefault();
            return false;

        });
    }
}

